[
  {
    "role": "مطور واجهات أمامية أول",
    "company": "شركة الابتكارات التقنية",
    "slug": "senior-frontend-developer",
    "type": "دوام كامل",
    "period": "يناير 2022 - الحاضر",
    "location": "عن بعد",
    "summary": "قيادة تطوير الواجهات الأمامية لمنصة SaaS بأكثر من 50,000 مستخدم.",
    "description": "بصفتي مطور واجهات أمامية أول في شركة الابتكارات التقنية، أقود تطوير منتجنا الرئيسي SaaS، مع التركيز على إنشاء واجهات مستخدم بديهية وتحسين الأداء.\n\nأتعاون مع المصممين ومديري المنتجات ومطوري الواجهات الخلفية لتنفيذ ميزات جديدة وتحسين الميزات الموجودة. لقد قدمت TypeScript وأنماط React الحديثة إلى قاعدة التعليمات البرمجية لدينا، مما أدى إلى انخفاض بنسبة 40٪ في أخطاء الواجهة الأمامية.\n\nأقوم أيضًا بتوجيه المطورين المبتدئين والمساهمة في القرارات المعمارية التي تشكل مستقبل منتجنا.",
    "skills": [
      "React",
      "TypeScript",
      "Next.js",
      "Redux",
      "Jest",
      "Cypress",
      "CI/CD",
      "قيادة الفريق",
      "مراجعة الأكواد",
      "التوجيه"
    ],
    "projects": [
      "إعادة تصميم واجهة لوحة التحكم، وتحسين تفاعل المستخدمين بنسبة 25٪",
      "تنفيذ نظام مصادقة جديد مع دعم SSO",
      "إنشاء مكتبة مكونات تستخدم عبر منتجات متعددة",
      "تحسين أداء التطبيق، وتقليل وقت التحميل بنسبة 40٪"
    ]
  },
  {
    "role": "مطور واجهات أمامية",
    "company": "شركة حلول الويب",
    "slug": "frontend-developer",
    "type": "دوام كامل",
    "period": "مارس 2020 - ديسمبر 2021",
    "location": "نيويورك، نيويورك",
    "summary": "تطوير تطبيقات ويب متجاوبة للعملاء عبر مختلف الصناعات.",
    "description": "بصفتي مطور واجهات أمامية في شركة حلول الويب، كنت مسؤولاً عن بناء تطبيقات ويب متجاوبة وسهلة الوصول للعملاء في قطاعات المالية والرعاية الصحية والتجارة الإلكترونية.\n\nعملت في فريق رشيق مكون من 6 مطورين، شاركت في تخطيط السبرينت والاجتماعات اليومية والاستعراضات الرجعية. نفذت تصاميم دقيقة للغاية باستخدام React و styled-components، مما يضمن التوافق عبر المتصفحات والتخطيطات المتجاوبة.\n\nتعاونت أيضًا مع مطوري الواجهات الخلفية لدمج واجهات برمجة التطبيقات RESTful وتحسين استراتيجيات جلب البيانات.",
    "skills": [
      "React",
      "JavaScript",
      "CSS/SCSS",
      "HTML5",
      "واجهات برمجة REST",
      "Git",
      "منهجية Agile",
      "اختبار متعدد المتصفحات",
      "التصميم المتجاوب"
    ],
    "projects": [
      "بناء منصة تجارة إلكترونية لبائع تجزئة للأزياء",
      "تطوير بوابة مرضى لمقدم رعاية صحية",
      "إنشاء لوحة تحكم تفاعلية لشركة خدمات مالية",
      "تنفيذ نظام حجز لعميل ضيافة"
    ]
  },
  {
    "role": "متدرب تطوير ويب",
    "company": "المبدعون الرقميون",
    "slug": "web-development-intern",
    "type": "تدريب",
    "period": "يونيو 2019 - فبراير 2020",
    "location": "بوسطن، ماساتشوستس",
    "summary": "المساعدة في تطوير مواقع الويب وتطبيقات الويب للشركات الصغيرة.",
    "description": "بصفتي متدرب تطوير ويب في المبدعون الرقميون، ساعدت فريق التطوير في بناء مواقع الويب وتطبيقات الويب للشركات الصغيرة والشركات الناشئة.\n\nكنت مسؤولاً عن تنفيذ تخطيطات متجاوبة باستخدام HTML و CSS و JavaScript، وصيانة مواقع العملاء الحالية. شاركت أيضًا في اجتماعات العملاء لفهم المتطلبات وتقديم تحديثات التقدم.\n\nوفر لي هذا التدريب خبرة قيمة في بيئة تطوير احترافية وحسنت مهاراتي التقنية والتواصلية.",
    "skills": [
      "HTML",
      "CSS",
      "JavaScript",
      "WordPress",
      "التصميم المتجاوب",
      "التواصل مع العملاء",
      "إدارة الوقت",
      "حل المشكلات"
    ],
    "projects": [
      "تطوير موقع معرض أعمال لمصور محلي",
      "إنشاء موقع WordPress لمطعم مع قدرات الطلب عبر الإنترنت",
      "المساعدة في بناء صفحة هبوط لشركة ناشئة للتطبيقات المحمولة",
      "صيانة وتحديث المحتوى لمواقع عملاء متعددة"
    ]
  }
]