[
  {
    "role": "Développeur Full Stack",
    "company": "ITC",
    "slug": "itc-developer",
    "type": "Contrat",
    "period": "Juin 2024 - Sep 2024",
    "location": "À distance",
    "summary": "Développement de 'ITC Hub', une plateforme interne complète pour la gestion des départements et des équipes.",
    "description": "Conception et construction de 'ITC Hub', un outil interne pour rationaliser la communication et la gestion de projet. J'étais responsable du développement full-stack en utilisant Next.js et TypeScript. Les principales réalisations incluent la conception d'un schéma de base de données relationnelle complexe avec Prisma, la mise en œuvre du contrôle d'accès basé sur les rôles (RBAC) avec Next-Auth pour une gestion sécurisée des utilisateurs, et la création d'une interface utilisateur réactive avec Tailwind CSS.",
    "skills": [
      "Next.js",
      "TypeScript",
      "Prisma",
      "PostgreSQL",
      "Next-Auth",
      "Tailwind CSS",
      "Conception de système"
    ],
    "projects": [
      "ITC Hub - Plateforme de communication et de gestion interne"
    ]
  },
  {
    "role": "Ingénieur Logiciel Junior",
    "company": "Indépendant / Freelance",
    "slug": "junior-software-engineer",
    "type": "Temps plein",
    "period": "2023 - Présent",
    "location": "À distance",
    "summary": "Développement d'applications web et de bureau, avec un accent sur JavaScript/TypeScript full-stack et l'exploration de Rust.",
    "description": "En tant qu'Ingénieur Logiciel Junior, je développe divers projets, notamment un site web portfolio, l'IDE C-Studio et le système de gestion agricole Algis pour un client. Je me concentre sur l'utilisation de technologies web modernes comme Next.js, React, TypeScript et Node.js, ainsi que Prisma pour la gestion de base de données. J'acquiers également de l'expérience avec Rust à travers des projets comme iShowOff et j'explore l'architecture logicielle et la gestion de paquets.",
    "skills": [
      "TypeScript",
      "JavaScript",
      "React",
      "Next.js",
      "Node.js",
      "Prisma",
      "PostgreSQL",
      "SQLite",
      "Electron",
      "Rust",
      "Git",
      "GitHub Actions",
      "Docker",
      "Tailwind CSS",
      "HTML",
      "CSS"
    ],
    "projects": [
      "Développement et maintenance du site portfolio personnel (Next.js, TypeScript)",
      "Création de C-Studio, un IDE C sans configuration pour Windows (Electron, TypeScript, React)",
      "Développement d'Algis, un système de gestion agricole (Next.js, TypeScript, Prisma, PostgreSQL - projet client privé)",
      "Personnalisation d'iShowOff, un outil CLI basé sur Rust, pour le README du profil GitHub",
      "Développement d'ITC Hub, une plateforme de communication interne et de gestion de projet (Next.js, TypeScript, Prisma, PostgreSQL)"
    ]
  }
]
