[
  {
    "category": "فكاهة البرمجة",
    "text": "لماذا يفضل المبرمجون الوضع الداكن؟ لأن الضوء يجذب الأخطاء!"
  },
  {
    "category": "تاريخ التقنية",
    "text": "تم إنشاء أول فيروس كمبيوتر في عام 1983 وكان يسمى 'Elk Cloner'."
  },
  {
    "category": "حقيقة برمجية",
    "text": "كانت أول مبرمجة في التاريخ امرأة تدعى Ada Lovelace، التي كتبت الخوارزمية الأولى لمحرك تحليلي تشارلز باباج في أربعينيات القرن التاسع عشر."
  },
  {
    "category": "معلومة عن الويب",
    "text": "أول موقع ويب تم إنشاؤه لا يزال متاحًا على الإنترنت! يمكنك زيارته على info.cern.ch."
  },
  {
    "category": "فكاهة البرمجة",
    "text": "دخل استعلام SQL إلى حانة، اقترب من طاولتين وسأل: 'هل يمكنني الانضمام إليكما؟'"
  },
  {
    "category": "تاريخ التقنية",
    "text": "نشأ مصطلح 'bug' لوصف خلل في الكمبيوتر في عام 1947 عندما وجدت Grace Hopper عثة تسبب مشاكل في كمبيوتر Harvard Mark II."
  },
  {
    "category": "حقيقة برمجية",
    "text": "تم إنشاء JavaScript في 10 أيام فقط بواسطة Brendan Eich في عام 1995."
  },
  {
    "category": "معلومة عن الويب",
    "text": "كان متوسط حجم صفحة الويب في عام 1995 هو 14 كيلوبايت. اليوم، يتجاوز 2 ميجابايت!"
  },
  {
    "category": "فكاهة البرمجة",
    "text": "لماذا يرتدي مطورو Java نظارات؟ لأنهم لا يرون C#!"
  },
  {
    "category": "تاريخ التقنية",
    "text": "كانت أول فأرة كمبيوتر مصنوعة من الخشب واخترعها Doug Engelbart في عام 1964."
  },
  {
    "category": "حقيقة برمجية",
    "text": "هناك حوالي 700 لغة برمجة قيد الاستخدام اليوم."
  },
  {
    "category": "معلومة عن الويب",
    "text": "أغلى اسم نطاق تم بيعه على الإطلاق كان Cars.com مقابل 872 مليون دولار."
  },
  {
    "category": "فكاهة البرمجة",
    "text": "هناك 10 أنواع من الأشخاص في العالم: أولئك الذين يفهمون النظام الثنائي وأولئك الذين لا يفهمونه."
  },
  {
    "category": "تاريخ التقنية",
    "text": "تم إرسال أول تغريدة بواسطة Jack Dorsey في 21 مارس 2006. قالت 'just setting up my twttr'."
  },
  {
    "category": "حقيقة برمجية",
    "text": "لغة البرمجة الأكثر شهرة، JavaScript، تم تطويرها في الأصل في 10 أيام فقط."
  }
]