[
  {
    "title": "منصة التجارة الإلكترونية",
    "slug": "ecommerce-platform",
    "shortDescription": "متجر إلكتروني متكامل مع معالجة المدفوعات",
    "description": "منصة تجارة إلكترونية حديثة مبنية باستخدام Next.js، تتضمن قوائم المنتجات وعربة التسوق ومصادقة المستخدم وتكامل Stripe للمدفوعات.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "Next.js",
      "React",
      "TypeScript",
      "Tailwind CSS",
      "Stripe"
    ],
    "timeline": "3 أشهر (يناير 2023 - مارس 2023)",
    "liveUrl": "https://example-ecommerce.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/ecommerce",
    "personalExperience": "كان بناء منصة التجارة الإلكترونية هذه تجربة رائعة في دمج واجهات برمجة التطبيقات التابعة لجهات خارجية مثل Stripe وإدارة الحالة العامة لعربة التسوق. ركزت على إنشاء واجهة مستخدم نظيفة ومتجاوبة وعملية دفع آمنة.",
    "collaborators": []
  },
  {
    "slug": "itc-hub",
    "fetchUrl": "https://itc-hub.vercel.app",
    "title": "مركز ITC",
    "shortDescription": "منصة داخلية لتبسيط التواصل وإدارة المشاريع والتعاون.",
    "description": "منصة داخلية شاملة مصممة لإدارة الأقسام والفرق ونظام تذاكر كامل وتقويم الأحداث. تتميز بنظام إدارة مستخدمين قائم على الأدوار (مسؤول، مدير، مستخدم)، ومصادقة آمنة، ونظام إشعارات لتعزيز سير العمل المنظم والفعال.",
    "image": "https://itc-hub.vercel.app/ITC%20HUB%20Home.png",
    "technologies": [
      "Next.js",
      "React",
      "TypeScript",
      "Tailwind CSS",
      "shadcn/ui",
      "Prisma",
      "PostgreSQL",
      "Next-Auth",
      "React Hook Form",
      "Zod",
      "Nodemailer",
      "Recharts"
    ],
    "timeline": "4 أشهر (يونيو 2024 - سبتمبر 2024)",
    "liveUrl": "https://itc-hub.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/itc-hub",
    "personalExperience": "كان تطوير مركز ITC غوصًا عميقًا في تطوير Next.js الكامل. كان التحدي الأكبر هو تصميم مخطط قاعدة البيانات العلائقية مع Prisma للتعامل مع العلاقات المعقدة بين المستخدمين والأقسام والفرق والتذاكر. كان تنفيذ التحكم في الوصول على أساس الدور (RBAC) مع Next-Auth ميزة حاسمة لضمان أمان البيانات. عزز هذا المشروع مهاراتي في بناء تطبيقات ويب آمنة وقابلة للتوسع وكثيفة البيانات.",
    "collaborators": []
  },
  {
    "slug": "ishowoff",
    "fetchUrl": "https://github.com/samibentaiba/ishowoff",
    "title": "iShowOff",
    "shortDescription": "أداة سطر أوامر مبنية على Go لعرض معلومات النظام.",
    "description": "iShowOff هي أداة CLI خفيفة الوزن ومتعددة المنصات مكتوبة بلغة Go. تجلب وتعرض معلومات النظام الرئيسية، مثل نظام التشغيل والمعالج والذاكرة واستخدام القرص، في مخرجات نظيفة ومنسقة. كان المشروع استكشافًا في Go والبرمجة على مستوى النظام و GitHub Actions لبناء عبر المنصات الآلي.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "Go",
      "GitHub Actions",
      "CLI"
    ],
    "timeline": "شهر واحد (أبريل 2024)",
    "liveUrl": null,
    "githubUrl": "https://github.com/samibentaiba/ishowoff",
    "personalExperience": "كان هذا أول مشروع رئيسي لي في Go. تعلمت الكثير عن التعامل مع واجهات برمجة التطبيقات الخاصة بنظام التشغيل، وإدارة التبعيات في Go، وإعداد خط أنابيب CI/CD مع GitHub Actions لتجميع وإصدار الملفات الثنائية لـ Windows و macOS و Linux.",
    "collaborators": []
  }
]