[
  {
    "title": "Plateforme E-commerce",
    "slug": "ecommerce-platform",
    "shortDescription": "Une boutique en ligne complète avec traitement des paiements",
    "description": "Une plateforme e-commerce moderne construite avec Next.js, comprenant des listes de produits, un panier d'achat, une authentification utilisateur et l'intégration de Stripe pour les paiements.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "Next.js",
      "React",
      "TypeScript",
      "Tailwind CSS",
      "Stripe"
    ],
    "timeline": "3 mois (Jan 2023 - Mar 2023)",
    "liveUrl": "https://example-ecommerce.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/ecommerce",
    "personalExperience": "La construction de cette plateforme e-commerce a été une excellente expérience pour l'intégration d'API tierces comme Stripe et la gestion de l'état global pour le panier d'achat. Je me suis concentré sur la création d'une interface utilisateur propre et réactive et d'un processus de paiement sécurisé.",
    "collaborators": []
  },
  {
    "slug": "itc-hub",
    "fetchUrl": "https://itc-hub.vercel.app",
    "title": "ITC Hub",
    "shortDescription": "Une plateforme interne pour rationaliser la communication, la gestion de projet et la collaboration.",
    "description": "Une plateforme interne complète conçue pour gérer les départements, les équipes, un système de tickets complet et un calendrier d'événements. Comprend un système de gestion des utilisateurs basé sur les rôles (Admin, Manager, Utilisateur), une authentification sécurisée et un système de notification pour favoriser un flux de travail organisé et efficace.",
    "image": "https://itc-hub.vercel.app/ITC%20HUB%20Home.png",
    "technologies": [
      "Next.js",
      "React",
      "TypeScript",
      "Tailwind CSS",
      "shadcn/ui",
      "Prisma",
      "PostgreSQL",
      "Next-Auth",
      "React Hook Form",
      "Zod",
      "Nodemailer",
      "Recharts"
    ],
    "timeline": "4 mois (Juin 2024 - Sep 2024)",
    "liveUrl": "https://itc-hub.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/itc-hub",
    "personalExperience": "Le développement d'ITC Hub a été une immersion profonde dans le développement full-stack avec Next.js. Le plus grand défi a été de concevoir le schéma de la base de données relationnelle avec Prisma pour gérer les relations complexes entre les utilisateurs, les départements, les équipes et les tickets. L'implémentation du contrôle d'accès basé sur les rôles (RBAC) avec Next-Auth était une fonctionnalité essentielle pour garantir la sécurité des données. Ce projet a consolidé mes compétences dans la création d'applications web sécurisées, évolutives et riches en données.",
    "collaborators": []
  },
  {
    "slug": "ishowoff",
    "fetchUrl": "https://github.com/samibentaiba/ishowoff",
    "title": "iShowOff",
    "shortDescription": "Un outil en ligne de commande basé sur Go pour afficher les informations système.",
    "description": "iShowOff est un outil CLI multiplateforme léger écrit en Go. Il récupère et affiche les informations système clés, telles que le système d'exploitation, le processeur, la mémoire et l'utilisation du disque, dans une sortie propre et formatée. Le projet était une exploration de Go, de la programmation au niveau système et des GitHub Actions pour les builds multiplateformes automatisés.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "Go",
      "GitHub Actions",
      "CLI"
    ],
    "timeline": "1 mois (Avr 2024)",
    "liveUrl": null,
    "githubUrl": "https://github.com/samibentaiba/ishowoff",
    "personalExperience": "C'était mon premier projet majeur en Go. J'ai beaucoup appris sur la gestion des API spécifiques au système d'exploitation, la gestion des dépendances en Go et la configuration d'un pipeline CI/CD avec GitHub Actions pour compiler et publier des binaires pour Windows, macOS et Linux.",
    "collaborators": []
  }
]