[
  {
    "slug": "cod-simulation",
    "fetchUrl": "https://github.com/samibentaiba/calculator",
    "title": "Tableau de Bord Simulation COD",
    "shortDescription": "Calculateur complet de métriques commerciales et de ROI pour le e-commerce COD.",
    "description": "Un calculateur et tableau de bord complet conçu pour les entreprises de e-commerce en paiement à la livraison (COD). Cette application permet de suivre les métriques commerciales, les coûts opérationnels et de calculer le ROI en temps réel. Les fonctionnalités incluent deux modes d'interface utilisateur (Invité & Productivité), le support des thèmes, et un suivi détaillé des métriques pour les opérations, le centre d'appels et l'expédition.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "Next.js",
      "TypeScript",
      "Tailwind CSS",
      "shadcn/ui",
      "Lucide React"
    ],
    "timeline": "2024",
    "liveUrl": "https://calculator-delta-flax.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/calculator",
    "personalExperience": "J'ai construit cet outil pour aider les propriétaires d'entreprises de e-commerce à visualiser leurs dépenses et leurs bénéfices. Il se concentre sur la fourniture d'une vue d'ensemble financière claire et en temps réel.",
    "collaborators": []
  },
  {
    "slug": "mosquito-killer",
    "fetchUrl": "https://github.com/samibentaiba/mosquito-killer-2",
    "title": "Mosquito Killer DZ",
    "shortDescription": "Page de destination pour la vente d'appareils anti-moustiques.",
    "description": "Une page de destination à fort taux de conversion conçue pour le marché algérien pour vendre des appareils anti-moustiques. Dispose d'un formulaire de commande simplifié, d'une vitrine de produits et d'une intégration avec les services de livraison locaux.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "Next.js",
      "React",
      "Tailwind CSS",
      "shadcn/ui",
      "Architecture Système",
      "Documentation Technique"
    ],
    "timeline": "2024",
    "liveUrl": "https://mosquito-killer-2.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/mosquito-killer-2",
    "personalExperience": "Conçu pour maximiser les taux de conversion pour un produit de e-commerce local. Axé sur la vitesse, la réactivité mobile et un processus de paiement sans friction.",
    "collaborators": []
  },
  {
    "slug": "algis",
    "title": "Algis",
    "shortDescription": "Système de gestion agricole freelance pour le Ministère de l'Agriculture algérien.",
    "description": "Algis est un système de gestion agricole complet conçu pour l'Office National du Développement Agricole (Ministère de l'Agriculture et du Développement Rural). Il numérise et rationalise la gestion des Unités de Production Agricole (UAP) à travers l'Algérie, en centralisant les données Excel dispersées dans une base de données relationnelle avec contrôle d'accès basé sur les rôles, suivi du bétail, gestion des équipements et analyses de production. Utilise PostgreSQL pour les versions hébergées et SQLite pour le développement local. Une mise à niveau entreprise potentielle utilisant Rust, MySQL, HTMX et jQuery est proposée au client.",
    "image": "/placeholder.svg?height=400&width=800",
    "liveUrl": "https://algis-preview.vercel.app",
    "status": "Développement Suspendu",
    "statusReason": "Projet suspendu en raison de problèmes de non-paiement du client.",
    "technologies": [
      "Next.js",
      "React",
      "TypeScript",
      "Prisma",
      "PostgreSQL",
      "NextAuth.js",
      "Tailwind CSS",
      "shadcn/ui",
      "Écosystème Linux",
      "Architecture Système",
      "Documentation Technique"
    ],
    "timeline": "En cours (2024 - Présent)",
    "githubUrl": null,
    "personalExperience": "C'était un projet freelance pour un client du secteur agricole. Le projet implique une modélisation de données complexe avec Prisma pour gérer les UAP, le bétail, les machines, les cultures et leurs relations. Je construis un tableau de bord moderne full-stack qui remplace les flux de travail manuels basés sur Excel par une application web dynamique avec authentification et contrôle d'accès basé sur les rôles. Le dépôt est privé en raison des conditions de service du client.",
    "collaborators": []
  },
  {
    "slug": "c-studio",
    "fetchUrl": "https://github.com/samibentaiba/c-studio",
    "title": "C-Studio",
    "shortDescription": "IDE C sans configuration pour Windows avec compilateur intégré.",
    "description": "C-Studio est un IDE moderne et léger conçu pour les débutants et les étudiants apprenant le C. Il élimine les tracas d'installation des compilateurs et de configuration des chemins en intégrant directement une chaîne d'outils MinGW portable dans l'application. Les fonctionnalités incluent: zéro configuration, compilateur intégré, interface moderne avec thème sombre, compilation et exécution instantanées, et support terminal interactif complet pour scanf et les fonctions d'entrée.",
    "image": "https://raw.githubusercontent.com/samibentaiba/c-studio/master/public/readme.png",
    "technologies": [
      "Electron",
      "TypeScript",
      "React",
      "MinGW-w64",
      "Node.js",
      "Windows",
      "Écosystème Linux",
      "Architecture Système",
      "Documentation Technique"
    ],
    "timeline": "2 mois (Oct 2024 - Déc 2024)",
    "liveUrl": null,
    "downloadUrl": "https://github.com/samibentaiba/c-studio/releases/download/v1.5.1/C-Studio-Setup-1.5.1.exe",
    "githubUrl": "https://github.com/samibentaiba/c-studio",
    "personalExperience": "Construire C-Studio a été un voyage passionnant dans le développement d'applications de bureau avec Electron. Le plus grand défi était d'intégrer le compilateur MinGW et de s'assurer qu'il fonctionne parfaitement sans aucune configuration système. Je me suis concentré sur la création d'une expérience conviviale pour les débutants apprenant la programmation C, avec des fonctionnalités comme la compilation instantanée et le support du terminal interactif.",
    "collaborators": []
  },
  {
    "slug": "itc-hub",
    "fetchUrl": "https://itc-hub.vercel.app",
    "title": "ITC Hub",
    "shortDescription": "Une plateforme interne pour rationaliser la communication, la gestion de projet et la collaboration.",
    "description": "Une plateforme interne complète conçue pour gérer les départements, les équipes, un système de tickets complet et un calendrier d'événements. Comprend un système de gestion des utilisateurs basé sur les rôles (Admin, Manager, Utilisateur), une authentification sécurisée et un système de notification pour favoriser un flux de travail organisé et efficace.",
    "image": "https://itc-hub.vercel.app/ITC%20HUB%20Home.png",
    "technologies": [
      "Next.js",
      "React",
      "TypeScript",
      "Tailwind CSS",
      "shadcn/ui",
      "Prisma",
      "PostgreSQL",
      "NextAuth.js",
      "React Hook Form",
      "Zod",
      "Nodemailer",
      "Recharts",
      "Écosystème Linux",
      "Architecture Système",
      "Documentation Technique"
    ],
    "timeline": "4 mois (Juin 2024 - Sep 2024)",
    "liveUrl": "https://itc-hub.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/itc-hub",
    "personalExperience": "Le développement d'ITC Hub a été une immersion profonde dans le développement full-stack avec Next.js. Le plus grand défi a été de concevoir le schéma de la base de données relationnelle avec Prisma pour gérer les relations complexes entre les utilisateurs, les départements, les équipes et les tickets. L'implémentation du contrôle d'accès basé sur les rôles (RBAC) avec Next-Auth était une fonctionnalité essentielle pour garantir la sécurité des données. Ce projet a consolidé mes compétences dans la création d'applications web sécurisées, évolutives et riches en données.",
    "collaborators": []
  },
  {
    "slug": "remdani-dental",
    "fetchUrl": "https://github.com/ismail-devmaster/finalProjectFe",
    "title": "Centre Dentaire Remdani",
    "shortDescription": "Site web pour le Centre Dentaire Remdani.",
    "description": "Un site web professionnel pour le Centre Dentaire Remdani, présentant les services, les membres de l'équipe et les témoignages de patients. La plateforme offre une interface conviviale permettant aux patients de s'informer sur les soins dentaires et de contacter la clinique.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": ["React", "Node.js", "Tailwind CSS", "Écosystème Linux"],
    "timeline": "2024",
    "liveUrl": "https://ramdani.vercel.app",
    "githubUrl": "https://github.com/ismail-devmaster/finalProjectFe",
    "personalExperience": "J'ai collaboré en tant que développeur frontend sur ce projet, travaillant en étroite collaboration avec le développeur backend et le responsable du déploiement. J'ai également contribué au développement backend avec de petits commits, acquérant ainsi une expérience full-stack.",
    "collaborators": ["Ismail (Backend)", "Zinnedine (Déploiement)"]
  },
  {
    "slug": "sunrise-energy",
    "fetchUrl": "https://github.com/samibentaiba/sunrise-energy",
    "title": "Sunrise Energy",
    "shortDescription": "Plateforme de solutions d'énergie renouvelable freelance (Aperçu client).",
    "description": "Une plateforme web moderne conçue pour une entreprise d'énergie renouvelable. Ce projet sert d'aperçu client pour démontrer le potentiel d'une présence numérique dans le secteur de l'énergie. Il présente un design propre et écologique et met en valeur les services et solutions.",
    "image": "/placeholder.svg?height=400&width=800",
    "status": "Annulé",
    "statusReason": "Projet annulé en raison de problèmes de non-paiement du client.",
    "technologies": [
      "Next.js",
      "TypeScript",
      "Prisma",
      "Tailwind CSS",
      "shadcn/ui"
    ],
    "timeline": "1 mois (2024)",
    "liveUrl": null,
    "githubUrl": "https://github.com/samibentaiba/sunrise-energy",
    "personalExperience": "Ce projet freelance m'a permis de me concentrer sur la création d'une interface professionnelle et visuellement attrayante pour un client corporatif. J'ai utilisé Next.js pour les performances et le référencement, garantissant que le site est rapide et facile à découvrir.",
    "collaborators": []
  },
  {
    "slug": "ai-horizons",
    "fetchUrl": "https://github.com/samibentaiba/AiHorizons",
    "title": "AiHorizons",
    "shortDescription": "Plateforme de conférence et d'événements sur l'IA.",
    "description": "Une plateforme dynamique pour une conférence sur l'IA, comprenant des calendriers d'événements, des profils de conférenciers et des inscriptions. Ce projet était un défi de développement rapide, livré en seulement 3 jours.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "React",
      "TypeScript",
      "Tailwind CSS",
      "Vite",
      "Figma",
      "Manipulation de Pipelines"
    ],
    "timeline": "3 jours (2025)",
    "liveUrl": "https://ai-horizons.netlify.app",
    "githubUrl": "https://github.com/samibentaiba/AiHorizons",
    "personalExperience": "C'était un projet à haute intensité où j'ai collaboré étroitement avec un développeur backend et un designer UI/UX pour livrer un produit soigné dans un délai très court. Cela a testé ma capacité à travailler sous pression et à coordonner efficacement avec une équipe.",
    "collaborators": ["Raouh Robo (Backend)", "Louai Derradji (UI/UX)"]
  },
  {
    "slug": "itc-talks",
    "fetchUrl": "https://github.com/samibentaiba/itc-talks",
    "title": "ITC Talks",
    "shortDescription": "Plateforme d'événements pour les conférences et présentations ITC.",
    "description": "Une plateforme dédiée à l'hébergement et à la gestion des conférences ITC. Elle offre un espace aux conférenciers pour partager leurs connaissances et aux participants pour découvrir les événements à venir.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "Next.js",
      "TypeScript",
      "Tailwind CSS",
      "shadcn/ui",
      "Figma"
    ],
    "timeline": "En cours (2025)",
    "liveUrl": "https://itc-talks.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/itc-talks",
    "personalExperience": "J'ai collaboré avec un designer UI/UX pour donner vie à la vision d'ITC Talks. Je me suis concentré sur la création d'une expérience utilisateur engageante et d'un flux de gestion de contenu fluide.",
    "collaborators": ["Louai Derradji (UI/UX)"]
  },
  {
    "slug": "itc-programming",
    "fetchUrl": "https://github.com/samibentaiba/ITCP",
    "title": "ITCP",
    "shortDescription": "Site officiel du club de programmation ITC.",
    "description": "Le site officiel du club de programmation ITC, conçu pour présenter les activités du club, les événements et les ressources pour les membres. Un effort collaboratif pour construire un centre communautaire.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "React",
      "Vite",
      "CSS",
      "Figma",
      "Architecture Système",
      "Documentation Technique",
      "Python"
    ],
    "timeline": "2024",
    "liveUrl": "https://itc-programming.netlify.app",
    "githubUrl": "https://github.com/samibentaiba/ITCP",
    "personalExperience": "J'ai travaillé en tant que développeur frontend dans une équipe avec un développeur backend et un designer UI/UX. Ce projet a amélioré mes compétences en travail d'équipe et ma capacité à intégrer des composants frontend avec des API backend.",
    "collaborators": ["Mohamed Rebbouh (Backend)", "Louai Derradji (UI/UX)"]
  },
  {
    "slug": "cse-hub",
    "fetchUrl": "https://github.com/samibentaiba/cse-hub",
    "title": "CSE Hub",
    "shortDescription": "Site web du CSE USDB promo 2023.",
    "description": "Un hub central pour le CSE USDB promo 2023, fournissant des informations sur le club, ses départements et ses événements. C'était mon premier projet en tant qu'ingénieur logiciel.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": ["React", "Vite", "Figma"],
    "timeline": "2024",
    "liveUrl": "https://cse-hub.netlify.app/home",
    "githubUrl": "https://github.com/samibentaiba/cse-hub",
    "personalExperience": "Mon premier projet significatif en tant que développeur frontend. J'ai collaboré avec un designer UI/UX pour traduire les designs en code, posant les bases de ma carrière en ingénierie logicielle.",
    "collaborators": ["Louai Derradji (UI/UX)"]
  },
  {
    "slug": "h2-springboot",
    "fetchUrl": "https://github.com/samibentaiba/H2-SpringBoot",
    "title": "Microservices & DevOps",
    "shortDescription": "Microservices Spring Boot avec base de données H2.",
    "description": "Un projet technique démontrant la mise en œuvre d'une architecture de microservices utilisant Spring Boot et une base de données H2. Se concentre sur la logique backend, la persistance des données et les pratiques DevOps.",
    "image": "/Microservices.jpg",
    "technologies": [
      "Java",
      "Spring Boot",
      "Angular",
      "H2 Database",
      "Microservices",
      "Écosystème Linux",
      "Architecture Système",
      "Documentation Technique"
    ],
    "timeline": "2025",
    "liveUrl": null,
    "githubUrl": "https://github.com/samibentaiba/H2-SpringBoot",
    "personalExperience": "J'ai élargi mes compétences au backend et au DevOps en travaillant avec Java Spring Boot et les microservices. Ce projet m'a donné une compréhension plus approfondie de l'architecture full-stack et de la gestion de base de données.",
    "collaborators": []
  },
  {
    "slug": "ishowoff",
    "fetchUrl": "https://github.com/samibentaiba/ishowoff",
    "title": "iShowOff",
    "shortDescription": "Un outil CLI forké pour afficher mes derniers projets sur mon profil GitHub.",
    "description": "iShowOff est un fork d'un outil CLI que j'ai personnalisé pour afficher mes derniers projets en cours sur le README de mon profil GitHub (github.com/samibentaiba/samibentaiba). Grâce à ce projet, j'ai appris à utiliser efficacement GitHub Actions pour les workflows automatisés et les pipelines CI/CD.",
    "image": "https://github.com/samibentaiba/ishowoff/raw/main/images/ishowspeed.jpg",
    "technologies": [
      "Rust",
      "GitHub Actions",
      "CI/CD",
      "Écosystème Linux",
      "IDEs & Éditeurs",
      "Architecture Système",
      "Documentation Technique"
    ],
    "timeline": "1 mois (Avr 2024)",
    "liveUrl": null,
    "githubUrl": "https://github.com/samibentaiba/ishowoff",
    "personalExperience": "Ce fut une expérience d'apprentissage précieuse avec GitHub Actions. En forkant et en personnalisant ce projet, j'ai acquis une expérience pratique des pipelines CI/CD, des releases automatisées, et de l'intégration de contenu dynamique dans le README de mon profil GitHub.",
    "collaborators": []
  }
]
