[
  {
    "category": "عمليات التطوير (DevOps)",
    "slug": "development-operations",
    "description": "دمج أنظمة التشغيل، والواجهة الأمامية، والواجهة الخلفية، واللغات لإدارة الحالة المعقدة وسير العمل.",
    "longDescription": "تستخدم عمليات التطوير جميع مهارات أنظمة التشغيل والواجهة الأمامية والواجهة الخلفية ولغات البرمجة وغيرها من التقنيات. إنها تتعامل مع عمل أشخاص آخرين بسبب الحالة المعقدة التي يمكن أن تصل إليها وتتعامل مع العديد من المجالات.",
    "items": [
      {
        "name": "معالجة خطوط الأنابيب",
        "slug": "pipeline-manipulation",
        "experience": "تطبيق",
        "description": "استخدام ngrok لكشف الخوادم المحلية ومعالجة خطوط الأنابيب لاختبار الويب هوك. استخدمت بفعالية في مشروع AiHorizons."
      },
      {
        "name": "Microservices",
        "slug": "microservices",
        "experience": "تطبيق",
        "description": "تصميم التطبيقات كمجموعة من الخدمات المترابطة بشكل فضفاض. استكشفت هذه البنية في مشروع H2-SpringBoot."
      },
      {
        "name": "Git",
        "slug": "git",
        "experience": "4 سنوات",
        "description": "Git هو نظام التحكم في الإصدارات الموزع. أستخدم Git يوميًا للتحكم في الإصدارات والتعاون وإدارة تغييرات الكود عبر المشاريع."
      },
      {
        "name": "GitHub Actions",
        "slug": "github-actions",
        "experience": "سنة واحدة",
        "description": "أتمتة سير عمل البرمجيات باستخدام خطوط أنابيب CI/CD مباشرة في GitHub. أستخدمها للاختبار والنشر الآلي."
      },
      {
        "name": "CI/CD",
        "slug": "ci-cd",
        "experience": "تطبيق",
        "description": "ممارسات التكامل المستمر والنشر المستمر لأتمتة عملية تسليم البرمجيات."
      },
      {
        "name": "Docker",
        "slug": "docker",
        "experience": "سنتان",
        "description": "Docker هي منصة لتطوير وشحن وتشغيل التطبيقات في حاويات. أستخدم Docker لإنشاء بيئات تطوير متسقة وتبسيط عمليات النشر."
      },
      {
        "name": "Vercel",
        "slug": "vercel",
        "experience": "سنتان",
        "description": "Vercel هي منصة نشر وتعاون لمطوري الواجهة الأمامية. أستخدم Vercel لنشر واستضافة تطبيقات الويب، مستفيدًا من وظائفها بدون خادم وشبكة الحافة."
      },
      {
        "name": "نظام Linux",
        "slug": "linux",
        "experience": "إتقان",
        "description": "إتقان عميق لتوزيعات مثل Arch و Ubuntu و Fedora و Debian و Kali و Mint و Nix. متمكن من البرمجة النصية للصدفة (Shell Scripting) وتكوين النظام."
      },
      {
        "name": "أنظمة Unix",
        "slug": "unix",
        "experience": "متمكن",
        "description": "خبرة في macOS و OpenBSD، مع الاستفادة من استقرارها وفلسفة Unix لبيئات تطوير قوية."
      },
      {
        "name": "Windows",
        "slug": "windows",
        "experience": "متمكن",
        "description": "يستخدم بشكل أساسي للتعاون في التصميم (Figma) واختبار التوافق، مع إدارة قيود التطوير بتكوينات مخصصة."
      }
    ]
  },
  {
    "category": "تطوير الواجهات الأمامية",
    "slug": "frontend-development",
    "description": "بناء واجهات مستخدم متجاوبة وسهلة الوصول",
    "longDescription": "يركز تطوير الواجهات الأمامية على إنشاء العناصر المرئية والتفاعلية لمواقع الويب والتطبيقات التي يتفاعل معها المستخدمون مباشرة. تمكنني هذه المهارات من بناء واجهات مستخدم بديهية ومتجاوبة وسهلة الوصول توفر تجارب مستخدم ممتازة عبر جميع الأجهزة.\n\nمع مهارات الواجهة الأمامية القوية، يمكنني تحويل التصاميم إلى واجهات وظيفية، وتنفيذ التفاعلات المعقدة، وتحسين الأداء، وضمان استيفاء معايير إمكانية الوصول. يتطلب تطوير الواجهة الأمامية الحديثة مزيجًا من الحساسية التصميمية والمعرفة التقنية وفهم مبادئ تجربة المستخدم.",
    "items": [
      {
        "name": "React",
        "slug": "react",
        "experience": "3 سنوات",
        "description": "React هي مكتبة JavaScript لبناء واجهات المستخدم. استخدمت React على نطاق واسع لبناء تطبيقات أحادية الصفحة، مع التركيز على الهندسة المعمارية القائمة على المكونات وإدارة الحالة باستخدام الخطافات وواجهة برمجة التطبيقات السياقية."
      },
      {
        "name": "Next.js",
        "slug": "nextjs",
        "experience": "سنتان",
        "description": "Next.js هو إطار عمل React يتيح العرض من جانب الخادم وتوليد المواقع الثابتة. استخدمت Next.js لبناء تطبيقات ويب عالية الأداء وصديقة لمحركات البحث، مستفيدًا من نظام التوجيه القائم على الملفات ومسارات API."
      },
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "سنتان",
        "description": "TypeScript هي لغة برمجة مكتوبة بقوة تبني على JavaScript. أستخدم TypeScript في جميع مشاريعي لضمان أمان النوع وتحسين تجربة المطور بأدوات أفضل وتوثيق أفضل."
      },
      {
        "name": "Tailwind CSS",
        "slug": "tailwind",
        "experience": "سنتان",
        "description": "Tailwind CSS هو إطار عمل CSS يعتمد على الأدوات المساعدة. أستخدم Tailwind CSS لبناء تصاميم مخصصة بسرعة دون مغادرة HTML، مع التركيز على التصميم المتجاوب واتساق المكونات."
      },
      {
        "name": "shadcn/ui",
        "slug": "shadcn-ui",
        "experience": "سنة واحدة",
        "description": "مجموعة من المكونات القابلة لإعادة الاستخدام مبنية باستخدام Radix UI و Tailwind CSS. أستخدمها لبناء واجهات مستخدم سهلة الوصول وقابلة للتخصيص في مشاريع Next.js الخاصة بي."
      },
      {
        "name": "Vite",
        "slug": "vite",
        "experience": "سنة واحدة",
        "description": "Vite هي أداة بناء تهدف إلى توفير تجربة تطوير أسرع وأخف لمشاريع الويب الحديثة. أستخدمها لمشاريع React الخاصة بي."
      },
      {
        "name": "Angular",
        "slug": "angular",
        "experience": "أقل من سنة",
        "description": "Angular هي منصة لبناء تطبيقات الويب للأجهزة المحمولة وسطح المكتب. لدي خبرة بها من خلال مشروع H2-SpringBoot."
      },
      {
        "name": "Electron",
        "slug": "electron",
        "experience": "سنة واحدة",
        "description": "Electron هو إطار عمل لإنشاء تطبيقات أصلية بتقنيات الويب مثل JavaScript و HTML و CSS. استخدمته لبناء C-Studio IDE."
      }
    ]
  },
  {
    "category": "تطوير الواجهات الخلفية",
    "slug": "backend-development",
    "description": "بناء تطبيقات من جانب الخادم قابلة للتوسع وآمنة",
    "longDescription": "يتضمن تطوير الواجهات الخلفية إنشاء منطق من جانب الخادم الذي يشغل تطبيقات الويب. تتيح لي هذه المهارات بناء واجهات برمجة تطبيقات قوية، وإدارة قواعد البيانات، والتعامل مع المصادقة، ومعالجة البيانات بكفاءة.\n\nمهارات الواجهة الخلفية القوية ضرورية لإنشاء تطبيقات يمكنها التوسع للتعامل مع العديد من المستخدمين، والحفاظ على سلامة البيانات، وتوفير وصول آمن إلى الموارد. يتطلب تطوير الواجهة الخلفية معرفة تقنية عميقة بهندسات الخوادم وتصميم قواعد البيانات وأفضل ممارسات الأمان.",
    "items": [
      {
        "name": "Node.js",
        "slug": "nodejs",
        "experience": "3 سنوات",
        "description": "Node.js هو وقت تشغيل JavaScript مبني على محرك JavaScript V8 من Chrome. استخدمت Node.js لبناء واجهات برمجة تطبيقات RESTful والخدمات الصغيرة والتطبيقات من جانب الخادم، مع التركيز على الأداء وقابلية التوسع."
      },
      {
        "name": "Express",
        "slug": "express",
        "experience": "3 سنوات",
        "description": "Express هو إطار عمل تطبيق ويب Node.js بسيط ومرن. استخدمت Express لبناء واجهات برمجة تطبيقات RESTful وخوادم الويب، مع التركيز على هندسة البرمجيات الوسيطة والتوجيه."
      },
      {
        "name": "PostgreSQL",
        "slug": "postgresql",
        "experience": "سنتان",
        "description": "PostgreSQL هي قاعدة بيانات علائقية متقدمة ومفتوحة المصدر. استخدمت PostgreSQL لتخزين البيانات في تطبيقات مختلفة، مستفيدًا من ميزاتها القوية للاستعلامات المعقدة وسلامة البيانات."
      },
      {
        "name": "Prisma",
        "slug": "prisma",
        "experience": "سنة واحدة",
        "description": "Prisma هو ORM من الجيل التالي لـ Node.js و TypeScript. أستخدم Prisma للتفاعل مع قواعد البيانات، مستفيدًا من أمان النوع وواجهة برمجة التطبيقات البديهية لعمليات قاعدة البيانات."
      },
      {
        "name": "Java",
        "slug": "java",
        "experience": "سنة واحدة",
        "description": "Java هي لغة برمجة كائنية التوجه عالية المستوى. أستخدمها لتطوير الواجهة الخلفية مع Spring Boot."
      },
      {
        "name": "Spring Boot",
        "slug": "spring-boot",
        "experience": "سنة واحدة",
        "description": "Spring Boot هو إطار عمل مفتوح المصدر يعتمد على Java يستخدم لإنشاء خدمات مصغرة. أستخدمه لبناء خدمات خلفية قوية وقابلة للتوسع."
      },
      {
        "name": "Next.js",
        "slug": "nextjs-backend",
        "experience": "سنتان",
        "description": "أستفيد من Next.js للتطوير الشامل (Full Stack)، باستخدام مسارات API وإجراءات الخادم لبناء منطق خلفي آمن وقابل للتوسع مباشرة داخل التطبيق."
      },
      {
        "name": "NextAuth.js",
        "slug": "next-auth",
        "experience": "سنة واحدة",
        "description": "حل مصادقة كامل مفتوح المصدر لتطبيقات Next.js. أستخدمه للتعامل مع مصادقة المستخدم الآمنة وإدارة الجلسات."
      }
    ]
  },
  {
    "category": "لغات البرمجة",
    "slug": "programming-languages",
    "description": "اللغات التي أنا على دراية بها أو استكشفتها",
    "longDescription": "لدي أساس قوي في العديد من لغات البرمجة. أنا على دراية تامة بـ C و Bash، حيث استخدمتهما لبرمجة النظام والأتمتة. لقد استكشفت أيضًا مجموعة متنوعة من اللغات الأخرى لتوسيع فهمي للنماذج المختلفة، بما في ذلك C++ و C# و Python و Go و Haskell.",
    "items": [
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "متمكن",
        "description": "لغتي الأساسية لتطوير الويب، مما يضمن أمان النوع وجودة الكود."
      },
      {
        "name": "JavaScript",
        "slug": "javascript",
        "experience": "متمكن",
        "description": "فهم عميق لميزات ES6+ ومفاهيم اللغة الأساسية."
      },
      {
        "name": "C",
        "slug": "c-lang",
        "experience": "متمكن",
        "description": "أنا على دراية تامة بـ C، وأستخدمها لبرمجة النظام وفهم المفاهيم منخفضة المستوى. إنها اللغة الأساسية التي يدعمها C-Studio IDE الخاص بي."
      },
      {
        "name": "Bash",
        "slug": "bash",
        "experience": "متمكن",
        "description": "أستخدم نصوص Bash للأتمتة وإدارة بيئات التطوير."
      },
      {
        "name": "Rust",
        "slug": "rust",
        "experience": "أقل من سنة",
        "description": "Rust هي لغة تركز على الأداء والأمان. استكشفتها من خلال مشروع iShowOff ومهتم بإمكانياتها للحلول المؤسسية."
      },
      {
        "name": "Python",
        "slug": "python",
        "experience": "استكشاف",
        "description": "استكشفت Python لمهام البرمجة النصية ومعالجة البيانات."
      },
      {
        "name": "Go",
        "slug": "go",
        "experience": "استكشاف",
        "description": "استكشفت Go لنموذج التزامن الخاص بها والأداء في أنظمة الواجهة الخلفية."
      },
      {
        "name": "C++",
        "slug": "cpp",
        "experience": "استكشاف",
        "description": "استكشفت C++ لفهم البرمجة الكائنية التوجه على مستوى النظام."
      },
      {
        "name": "C#",
        "slug": "csharp",
        "experience": "استكشاف",
        "description": "استكشفت C# لمفاهيم تطوير سطح المكتب والألعاب."
      },
      {
        "name": "Haskell",
        "slug": "haskell",
        "experience": "استكشاف",
        "description": "استكشفت Haskell لفهم نماذج البرمجة الوظيفية."
      },
      {
        "name": "IDEs ومحررات النصوص",
        "slug": "ides-editors",
        "experience": "إتقان",
        "description": "إتقان Neovim و VS Code و Nano مع اختصارات مخصصة وضبط LSP وملفات تعريف. خبرة في JetBrains و Emacs و CodeBlocks. أحتفظ بتكوين Neovim مخصص (github.com/samibentaiba/nvim)."
      }
    ]
  },
  {
    "category": "الهندسة المعمارية والتوثيق",
    "slug": "architecture-documentation",
    "description": "تصميم أنظمة قابلة للتوسع وتوثيق التفاصيل التقنية",
    "longDescription": "أؤمن بأن البرمجيات العظيمة تبدأ بتصميم قوي ويتم صيانتها من خلال توثيق واضح. أستخدم أدوات مرئية لرسم معماريات النظام وأنماط التصميم، مما يضمن أن كل مكون مفهوم جيدًا وقابل للتوسع. يتضمن نهجي تحليلًا عميقًا للكود المصدري وإنشاء أدلة شاملة للصيانة المستقبلية.",
    "items": [
      {
        "name": "Figma",
        "slug": "figma",
        "experience": "تعاوني",
        "description": "تعلمت من خلال التعاون مع مصممي UI/UX لتنفيذ تصاميم دقيقة وفهم أنظمة التصميم."
      },
      {
        "name": "هندسة النظام",
        "slug": "system-architecture",
        "experience": "تطبيق",
        "description": "تصميم أنظمة قابلة للتوسع، وخدمات مصغرة، ومخططات قواعد البيانات. أستخدم أدوات مثل Excalidraw و Figma لتصور تدفقات الكود وأنماط التصميم والقرارات المعمارية."
      },
      {
        "name": "التوثيق التقني",
        "slug": "technical-documentation",
        "experience": "تطبيق",
        "description": "إنشاء توثيق شامل للكود وواجهات برمجة التطبيقات وتصاميم النظام باستخدام Obsidian. أركز على شرح 'السبب' وراء القرارات التقنية لتسهيل الصيانة والتأهيل."
      },
      {
        "name": "تحليل الكود المصدري",
        "slug": "source-code-analysis",
        "experience": "تطبيق",
        "description": "الغوص العميق في قواعد الكود المعقدة والتوثيق (مثل نواة WordPress) لفهم أفضل الممارسات، والهندسة العكسية للمنطق، وتنفيذ حلول قوية."
      }
    ]
  }
]