[
  {
    "category": "Opérations de Développement (DevOps)",
    "slug": "development-operations",
    "description": "Intégrer les systèmes d'exploitation, le frontend, le backend et les langages pour gérer des états et des flux de travail complexes.",
    "longDescription": "Les opérations de développement utilisent toutes les compétences des systèmes d'exploitation, du frontend, du backend, des langages de programmation et d'autres technologies. Elles gèrent le travail d'autres personnes en raison de l'état complexe qu'elles peuvent atteindre et traitent de nombreux domaines.",
    "items": [
      {
        "name": "Manipulation de Pipelines",
        "slug": "pipeline-manipulation",
        "experience": "Appliqué",
        "description": "Utilisation de ngrok pour exposer des serveurs locaux et manipuler des pipelines pour les tests de webhooks. Utilisé efficacement dans le projet AiHorizons."
      },
      {
        "name": "Microservices",
        "slug": "microservices",
        "experience": "Appliqué",
        "description": "Conception d'applications comme une collection de services faiblement couplés. J'ai exploré cette architecture dans le projet H2-SpringBoot."
      },
      {
        "name": "Git & GitHub",
        "slug": "git-github",
        "experience": "3+ ans",
        "description": "Git est un système de contrôle de version distribué. J'utilise Git et GitHub quotidiennement pour le contrôle de version, la collaboration et la gestion des changements de code à travers les projets, y compris l'utilisation de GitHub Actions pour le CI/CD."
      },
      {
        "name": "GitHub Actions",
        "slug": "github-actions",
        "experience": "1+ an",
        "description": "Automatisation des flux de travail logiciels avec des pipelines CI/CD directement dans GitHub. Je l'utilise pour les tests et le déploiement automatisés."
      },
      {
        "name": "CI/CD",
        "slug": "ci-cd",
        "experience": "Appliqué",
        "description": "Pratiques d'Intégration Continue et de Déploiement Continu pour automatiser le processus de livraison de logiciels."
      },
      {
        "name": "Docker",
        "slug": "docker",
        "experience": "1+ an",
        "description": "Docker est une plateforme pour développer, expédier et exécuter des applications dans des conteneurs. Utilisé pour créer des environnements de développement cohérents."
      },
      {
        "name": "Vercel",
        "slug": "vercel",
        "experience": "2+ ans",
        "description": "Vercel est une plateforme de déploiement et de collaboration pour les développeurs frontend. J'utilise Vercel pour déployer et héberger des applications web, en tirant parti de ses fonctions sans serveur et de son réseau edge."
      },
      {
        "name": "Écosystème Linux",
        "slug": "linux",
        "experience": "Maîtrisé",
        "description": "Maîtrise approfondie des distributions comme Arch, Ubuntu, Fedora, Debian, Kali, Mint et Nix. Compétent en scripting shell et configuration système."
      },
      {
        "name": "Systèmes Unix",
        "slug": "unix",
        "experience": "Familier",
        "description": "Expérience avec macOS et OpenBSD, tirant parti de leur stabilité et de la philosophie Unix pour des environnements de développement robustes."
      },
      {
        "name": "Windows",
        "slug": "windows",
        "experience": "Compétent",
        "description": "Utilisé principalement pour la collaboration design (Figma) et les tests de compatibilité, gérant les limitations de développement avec des configurations personnalisées."
      }
    ]
  },
  {
    "category": "Développement Frontend",
    "slug": "frontend-development",
    "description": "Création d'interfaces utilisateur réactives et accessibles",
    "longDescription": "Le développement frontend se concentre sur la création des éléments visuels et interactifs des sites web et des applications avec lesquels les utilisateurs interagissent directement. Ces compétences me permettent de créer des interfaces utilisateur intuitives, réactives et accessibles qui offrent d'excellentes expériences utilisateur sur tous les appareils.\n\nAvec de solides compétences frontend, je peux transformer des designs en interfaces fonctionnelles, implémenter des interactions complexes, optimiser les performances et garantir le respect des normes d'accessibilité. Le développement frontend moderne nécessite une combinaison de sensibilité au design, de connaissances techniques et d'une compréhension des principes d'expérience utilisateur.",
    "items": [
      {
        "name": "React",
        "slug": "react",
        "experience": "2+ ans",
        "description": "React est une bibliothèque JavaScript pour la création d'interfaces utilisateur. J'ai utilisé React de manière extensive pour créer des applications à page unique et des composants au sein de projets Next.js, en me concentrant sur l'architecture basée sur les composants et la gestion d'état avec les hooks et l'API de contexte."
      },
      {
        "name": "Next.js",
        "slug": "nextjs",
        "experience": "2+ ans",
        "description": "Next.js est un framework React qui permet le rendu côté serveur et la génération de sites statiques. J'ai utilisé Next.js pour créer des applications web performantes et optimisées pour le référencement, en tirant parti de son système de routage basé sur les fichiers et de ses routes API dans des projets comme mon portfolio, ITC Hub et Algis."
      },
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "2+ ans",
        "description": "TypeScript est un langage de programmation fortement typé qui s'appuie sur JavaScript. J'utilise TypeScript dans la plupart de mes projets (portfolio, c-studio, algis, itc-hub) pour assurer la sécurité des types et améliorer l'expérience de développement."
      },
      {
        "name": "Tailwind CSS",
        "slug": "tailwind",
        "experience": "2+ ans",
        "description": "Tailwind CSS est un framework CSS utilitaire. J'utilise Tailwind CSS pour créer rapidement des designs personnalisés sans quitter le HTML, en me concentrant sur la conception responsive et la cohérence des composants dans mes projets Next.js."
      },
      {
        "name": "shadcn/ui",
        "slug": "shadcn-ui",
        "experience": "1+ an",
        "description": "Une collection de composants réutilisables construits avec Radix UI et Tailwind CSS. Je l'utilise pour créer des interfaces utilisateur accessibles et personnalisables dans mes projets Next.js."
      },
      {
        "name": "HTML & CSS",
        "slug": "html-css",
        "experience": "3+ ans",
        "description": "Technologies web de base pour structurer et styliser le contenu web. Utilisées dans tous les projets web."
      },
      {
        "name": "Vite",
        "slug": "vite",
        "experience": "1+ an",
        "description": "Vite est un outil de construction qui vise à fournir une expérience de développement plus rapide et plus légère pour les projets web modernes. Je l'utilise pour mes projets React."
      },
      {
        "name": "Angular",
        "slug": "angular",
        "experience": "<1 an",
        "description": "Angular est une plateforme pour la création d'applications web mobiles et de bureau. J'ai de l'expérience avec grâce au projet H2-SpringBoot."
      },
      {
        "name": "Electron",
        "slug": "electron",
        "experience": "1 an",
        "description": "Electron est un framework pour créer des applications natives avec des technologies web comme JavaScript, HTML et CSS. Utilisé pour créer l'IDE C-Studio."
      }
    ]
  },
  {
    "category": "Développement Backend",
    "slug": "backend-development",
    "description": "Création d'applications côté serveur évolutives et sécurisées",
    "longDescription": "Le développement backend implique la création de la logique côté serveur qui alimente les applications web. Ces compétences me permettent de créer des API robustes, de gérer des bases de données, de gérer l'authentification et de traiter les données efficacement.\n\nDes compétences backend solides sont essentielles pour créer des applications qui peuvent évoluer pour gérer de nombreux utilisateurs, maintenir l'intégrité des données et fournir un accès sécurisé aux ressources. Le développement backend nécessite une connaissance technique approfondie des architectures de serveurs, de la conception de bases de données et des meilleures pratiques de sécurité.",
    "items": [
      {
        "name": "Node.js",
        "slug": "nodejs",
        "experience": "2+ ans",
        "description": "Node.js est un environnement d'exécution JavaScript construit sur le moteur JavaScript V8 de Chrome. J'ai utilisé Node.js pour la logique côté serveur dans les applications Next.js et pour les scripts, y compris au sein du projet Electron c-studio."
      },
      {
        "name": "Express",
        "slug": "express",
        "experience": "1+ an",
        "description": "Express est un framework d'application web Node.js minimal et flexible. Utilisé pour créer des API RESTful."
      },
      {
        "name": "PostgreSQL",
        "slug": "postgresql",
        "experience": "1+ an",
        "description": "PostgreSQL est une base de données relationnelle avancée et open-source. J'ai utilisé PostgreSQL avec Prisma pour le stockage de données dans des projets comme ITC Hub et Algis."
      },
      {
        "name": "Prisma",
        "slug": "prisma",
        "experience": "1+ an",
        "description": "Prisma est un ORM de nouvelle génération pour Node.js et TypeScript. J'utilise Prisma pour interagir avec les bases de données (PostgreSQL et SQLite) dans des projets comme ITC Hub et Algis."
      },
      {
        "name": "SQLite",
        "slug": "sqlite",
        "experience": "1+ an",
        "description": "SQLite est une bibliothèque en langage C qui implémente un moteur de base de données SQL petit, rapide, autonome, de haute fiabilité et complet. Utilisé pour le développement local dans le projet Algis."
      },
      {
        "name": "Java",
        "slug": "java",
        "experience": "1+ an",
        "description": "Java est un langage de programmation orienté objet de haut niveau. Je l'utilise pour le développement backend avec Spring Boot."
      },
      {
        "name": "Spring Boot",
        "slug": "spring-boot",
        "experience": "1+ an",
        "description": "Spring Boot est un framework open source basé sur Java utilisé pour créer des microservices. Je l'utilise pour construire des services backend robustes et évolutifs."
      },
      {
        "name": "Next.js",
        "slug": "nextjs-backend",
        "experience": "2+ ans",
        "description": "J'utilise Next.js pour le développement full-stack, en utilisant les routes API et les Server Actions pour construire une logique backend sécurisée et évolutive directement dans l'application."
      },
      {
        "name": "NextAuth.js",
        "slug": "next-auth",
        "experience": "1+ an",
        "description": "Une solution d'authentification open-source complète pour les applications Next.js. Je l'utilise pour gérer l'authentification sécurisée des utilisateurs et la gestion des sessions."
      }
    ]
  },
  {
    "category": "Langages de Programmation",
    "slug": "programming-languages",
    "description": "Langages avec lesquels je suis familier ou que j'ai explorés",
    "longDescription": "J'ai une base solide dans plusieurs langages de programmation. Je suis très familier avec C et Bash, les ayant utilisés pour la programmation système et l'automatisation. J'ai également exploré une variété d'autres langages pour élargir ma compréhension des différents paradigmes, notamment C++, C#, Python, Go et Haskell.",
    "items": [
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "Familier",
        "description": "Mon langage principal pour le développement web, assurant la sécurité des types et la qualité du code."
      },
      {
        "name": "JavaScript",
        "slug": "javascript",
        "experience": "Familier",
        "description": "Compréhension approfondie des fonctionnalités ES6+ et des concepts fondamentaux du langage."
      },
      {
        "name": "C",
        "slug": "c-lang",
        "experience": "Familier",
        "description": "Je suis très familier avec C, l'utilisant pour la programmation système et la compréhension des concepts de bas niveau. C'est le langage principal supporté par mon IDE C-Studio."
      },
      {
        "name": "Bash",
        "slug": "bash",
        "experience": "Familier",
        "description": "J'utilise les scripts Bash pour l'automatisation et la gestion des environnements de développement."
      },
      {
        "name": "Rust",
        "slug": "rust",
        "experience": "<1 an",
        "description": "Rust est un langage axé sur la performance et la sécurité. Exploré à travers le projet iShowOff et intéressé par son potentiel pour les solutions d'entreprise."
      },
      {
        "name": "Python",
        "slug": "python",
        "experience": "Exploré",
        "description": "Exploré Python pour les tâches de script et de traitement de données."
      },
      {
        "name": "Go",
        "slug": "go",
        "experience": "Exploré",
        "description": "Exploré Go pour son modèle de concurrence et ses performances dans les systèmes backend."
      },
      {
        "name": "C++",
        "slug": "cpp",
        "experience": "Exploré",
        "description": "Exploré C++ pour comprendre la programmation orientée objet au niveau système."
      },
      {
        "name": "C#",
        "slug": "csharp",
        "experience": "Exploré",
        "description": "Exploré C# pour les concepts de développement de bureau et de jeux."
      },
      {
        "name": "Haskell",
        "slug": "haskell",
        "experience": "Exploré",
        "description": "Exploré Haskell pour comprendre les paradigmes de programmation fonctionnelle."
      },
      {
        "name": "IDEs & Éditeurs",
        "slug": "ides-editors",
        "experience": "Maîtrisé",
        "description": "Maîtrise de Neovim, VS Code et Nano avec des raccourcis personnalisés, réglage LSP et profils. Expérimenté avec JetBrains, Emacs et CodeBlocks. Je maintiens une config Neovim personnalisée (github.com/samibentaiba/nvim)."
      }
    ]
  },
  {
    "category": "Architecture & Documentation",
    "slug": "architecture-documentation",
    "description": "Conception de systèmes évolutifs et documentation technique",
    "longDescription": "Je crois qu'un excellent logiciel commence par une conception solide et est maintenu grâce à une documentation claire. J'utilise des outils visuels pour cartographier les architectures système et les modèles de conception, en veillant à ce que chaque composant soit bien compris et évolutif. Mon approche implique une analyse approfondie du code source et la création de guides complets pour la maintenance future.",
    "items": [
      {
        "name": "Figma",
        "slug": "figma",
        "experience": "Collaboratif",
        "description": "Appris grâce à la collaboration avec des designers UI/UX pour implémenter des designs pixel-perfect et comprendre les systèmes de design."
      },
      {
        "name": "Architecture Système",
        "slug": "system-architecture",
        "experience": "Appliqué",
        "description": "Conception de systèmes évolutifs, de microservices et de schémas de base de données. J'utilise des outils comme Excalidraw et Figma pour visualiser les flux de code, les modèles de conception et les décisions architecturales."
      },
      {
        "name": "Documentation Technique",
        "slug": "technical-documentation",
        "experience": "Appliqué",
        "description": "Création d'une documentation complète pour le code, les API et les conceptions système à l'aide d'Obsidian. Je me concentre sur l'explication du 'pourquoi' derrière les décisions techniques pour faciliter la maintenance et l'intégration."
      },
      {
        "name": "Analyse de Code Source",
        "slug": "source-code-analysis",
        "experience": "Appliqué",
        "description": "Plongée profonde dans des bases de code complexes et de la documentation (par exemple, le cœur de WordPress) pour comprendre les meilleures pratiques, faire de l'ingénierie inverse et mettre en œuvre des solutions robustes."
      }
    ]
  }
]
