[
  {
    "category": "تطوير الواجهات الأمامية",
    "slug": "frontend-development",
    "description": "بناء واجهات مستخدم متجاوبة وسهلة الوصول",
    "longDescription": "يركز تطوير الواجهات الأمامية على إنشاء العناصر المرئية والتفاعلية لمواقع الويب والتطبيقات التي يتفاعل معها المستخدمون مباشرة. تمكنني هذه المهارات من بناء واجهات مستخدم بديهية ومتجاوبة وسهلة الوصول توفر تجارب مستخدم ممتازة عبر جميع الأجهزة.\n\nمع مهارات الواجهة الأمامية القوية، يمكنني تحويل التصاميم إلى واجهات وظيفية، وتنفيذ التفاعلات المعقدة، وتحسين الأداء، وضمان استيفاء معايير إمكانية الوصول. يتطلب تطوير الواجهة الأمامية الحديثة مزيجًا من الحساسية التصميمية والمعرفة التقنية وفهم مبادئ تجربة المستخدم.",
    "items": [
      {
        "name": "React",
        "slug": "react",
        "experience": "3 سنوات",
        "description": "React هي مكتبة JavaScript لبناء واجهات المستخدم. استخدمت React على نطاق واسع لبناء تطبيقات أحادية الصفحة، مع التركيز على الهندسة المعمارية القائمة على المكونات وإدارة الحالة باستخدام الخطافات وواجهة برمجة التطبيقات السياقية."
      },
      {
        "name": "Next.js",
        "slug": "nextjs",
        "experience": "سنتان",
        "description": "Next.js هو إطار عمل React يتيح العرض من جانب الخادم وتوليد المواقع الثابتة. استخدمت Next.js لبناء تطبيقات ويب عالية الأداء وصديقة لمحركات البحث، مستفيدًا من نظام التوجيه القائم على الملفات ومسارات API."
      },
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "سنتان",
        "description": "TypeScript هي لغة برمجة مكتوبة بقوة تبني على JavaScript. أستخدم TypeScript في جميع مشاريعي لضمان أمان النوع وتحسين تجربة المطور بأدوات أفضل وتوثيق أفضل."
      },
      {
        "name": "Tailwind CSS",
        "slug": "tailwind",
        "experience": "سنتان",
        "description": "Tailwind CSS هو إطار عمل CSS يعتمد على الأدوات المساعدة. أستخدم Tailwind CSS لبناء تصاميم مخصصة بسرعة دون مغادرة HTML، مع التركيز على التصميم المتجاوب واتساق المكونات."
      }
    ]
  },
  {
    "category": "تطوير الواجهات الخلفية",
    "slug": "backend-development",
    "description": "بناء تطبيقات من جانب الخادم قابلة للتوسع وآمنة",
    "longDescription": "يتضمن تطوير الواجهات الخلفية إنشاء منطق من جانب الخادم الذي يشغل تطبيقات الويب. تتيح لي هذه المهارات بناء واجهات برمجة تطبيقات قوية، وإدارة قواعد البيانات، والتعامل مع المصادقة، ومعالجة البيانات بكفاءة.\n\nمهارات الواجهة الخلفية القوية ضرورية لإنشاء تطبيقات يمكنها التوسع للتعامل مع العديد من المستخدمين، والحفاظ على سلامة البيانات، وتوفير وصول آمن إلى الموارد. يتطلب تطوير الواجهة الخلفية معرفة تقنية عميقة بهندسات الخوادم وتصميم قواعد البيانات وأفضل ممارسات الأمان.",
    "items": [
      {
        "name": "Node.js",
        "slug": "nodejs",
        "experience": "3 سنوات",
        "description": "Node.js هو وقت تشغيل JavaScript مبني على محرك JavaScript V8 من Chrome. استخدمت Node.js لبناء واجهات برمجة تطبيقات RESTful والخدمات الصغيرة والتطبيقات من جانب الخادم، مع التركيز على الأداء وقابلية التوسع."
      },
      {
        "name": "Express",
        "slug": "express",
        "experience": "3 سنوات",
        "description": "Express هو إطار عمل تطبيق ويب Node.js بسيط ومرن. استخدمت Express لبناء واجهات برمجة تطبيقات RESTful وخوادم الويب، مع التركيز على هندسة البرمجيات الوسيطة والتوجيه."
      },
      {
        "name": "PostgreSQL",
        "slug": "postgresql",
        "experience": "سنتان",
        "description": "PostgreSQL هي قاعدة بيانات علائقية متقدمة ومفتوحة المصدر. استخدمت PostgreSQL لتخزين البيانات في تطبيقات مختلفة، مستفيدًا من ميزاتها القوية للاستعلامات المعقدة وسلامة البيانات."
      },
      {
        "name": "Prisma",
        "slug": "prisma",
        "experience": "سنة واحدة",
        "description": "Prisma هو ORM من الجيل التالي لـ Node.js و TypeScript. أستخدم Prisma للتفاعل مع قواعد البيانات، مستفيدًا من أمان النوع وواجهة برمجة التطبيقات البديهية لعمليات قاعدة البيانات."
      }
    ]
  },
  {
    "category": "DevOps والأدوات",
    "slug": "devops-and-tools",
    "description": "تبسيط عمليات التطوير والنشر",
    "longDescription": "ممارسات وأدوات DevOps تسد الفجوة بين التطوير والعمليات، مما يتيح تسليم البرمجيات بشكل أسرع وأكثر موثوقية. تتيح لي هذه المهارات أتمتة سير العمل وإدارة البنية التحتية وضمان عمليات نشر متسقة.\n\nمن خلال تنفيذ ممارسات DevOps، يمكنني تقليل الوقت بين كتابة الكود ونشره في الإنتاج، مع الحفاظ على جودة وموثوقية عالية. يتطلب هذا المجال معرفة بالحاويات وخطوط CI/CD والبنية التحتية كرمز وأنظمة المراقبة.",
    "items": [
      {
        "name": "Git",
        "slug": "git",
        "experience": "4 سنوات",
        "description": "Git هو نظام التحكم في الإصدارات الموزع. أستخدم Git يوميًا للتحكم في الإصدارات والتعاون وإدارة تغييرات الكود عبر المشاريع."
      },
      {
        "name": "Docker",
        "slug": "docker",
        "experience": "سنتان",
        "description": "Docker هي منصة لتطوير وشحن وتشغيل التطبيقات في حاويات. أستخدم Docker لإنشاء بيئات تطوير متسقة وتبسيط عمليات النشر."
      },
      {
        "name": "GitHub Actions",
        "slug": "github-actions",
        "experience": "سنة واحدة",
        "description": "GitHub Actions هي منصة CI/CD متكاملة مع GitHub. أستخدم GitHub Actions لأتمتة الاختبار والبناء وسير عمل النشر لمشاريعي."
      },
      {
        "name": "Vercel",
        "slug": "vercel",
        "experience": "سنتان",
        "description": "Vercel هي منصة نشر وتعاون لمطوري الواجهة الأمامية. أستخدم Vercel لنشر واستضافة تطبيقات الويب، مستفيدًا من وظائفها بدون خادم وشبكة الحافة."
      }
    ]
  }
]