[
  {
    "category": "Frontend Development",
    "slug": "frontend-development",
    "description": "Building responsive and accessible user interfaces",
    "longDescription": "Frontend development focuses on creating the visual and interactive elements of websites and applications that users directly interact with. These skills enable me to build intuitive, responsive, and accessible user interfaces that provide excellent user experiences across all devices.\n\nWith strong frontend skills, I can transform designs into functional interfaces, implement complex interactions, optimize performance, and ensure accessibility standards are met. Modern frontend development requires a combination of design sensibility, technical knowledge, and an understanding of user experience principles.",
    "items": [
      {
        "name": "React",
        "slug": "react",
        "experience": "3 years",
        "description": "React is a JavaScript library for building user interfaces. I've used React extensively to build single-page applications, focusing on component-based architecture and state management with hooks and context API."
      },
      {
        "name": "Next.js",
        "slug": "nextjs",
        "experience": "2 years",
        "description": "Next.js is a React framework that enables server-side rendering and static site generation. I've used Next.js to build performant and SEO-friendly web applications, leveraging its file-based routing system and API routes."
      },
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "2 years",
        "description": "TypeScript is a strongly typed programming language that builds on JavaScript. I use TypeScript in all my projects to ensure type safety and improve developer experience with better tooling and documentation."
      },
      {
        "name": "Tailwind CSS",
        "slug": "tailwind",
        "experience": "2 years",
        "description": "Tailwind CSS is a utility-first CSS framework. I use Tailwind CSS to rapidly build custom designs without leaving HTML, focusing on responsive design and component consistency."
      }
    ]
  },
  {
    "category": "Backend Development",
    "slug": "backend-development",
    "description": "Building scalable and secure server-side applications",
    "longDescription": "Backend development involves creating the server-side logic that powers web applications. These skills allow me to build robust APIs, manage databases, handle authentication, and process data efficiently.\n\nStrong backend skills are essential for creating applications that can scale to handle many users, maintain data integrity, and provide secure access to resources. Backend development requires deep technical knowledge of server architectures, database design, and security best practices.",
    "items": [
      {
        "name": "Node.js",
        "slug": "nodejs",
        "experience": "3 years",
        "description": "Node.js is a JavaScript runtime built on Chrome's V8 JavaScript engine. I've used Node.js to build RESTful APIs, microservices, and server-side applications, focusing on performance and scalability."
      },
      {
        "name": "Express",
        "slug": "express",
        "experience": "3 years",
        "description": "Express is a minimal and flexible Node.js web application framework. I've used Express to build RESTful APIs and web servers, with a focus on middleware architecture and routing."
      },
      {
        "name": "PostgreSQL",
        "slug": "postgresql",
        "experience": "2 years",
        "description": "PostgreSQL is an advanced, open-source relational database. I've used PostgreSQL for data storage in various applications, leveraging its robust features for complex queries and data integrity."
      },
      {
        "name": "Prisma",
        "slug": "prisma",
        "experience": "1 year",
        "description": "Prisma is a next-generation ORM for Node.js and TypeScript. I use Prisma to interact with databases, taking advantage of its type-safety and intuitive API for database operations."
      }
    ]
  },
  {
    "category": "DevOps & Tools",
    "slug": "devops-and-tools",
    "description": "Streamlining development and deployment processes",
    "longDescription": "DevOps practices and tools bridge the gap between development and operations, enabling faster and more reliable software delivery. These skills allow me to automate workflows, manage infrastructure, and ensure consistent deployment processes.\n\nBy implementing DevOps practices, I can reduce the time between writing code and deploying it to production, while maintaining high quality and reliability. This area requires knowledge of containerization, CI/CD pipelines, infrastructure as code, and monitoring systems.",
    "items": [
      {
        "name": "Git",
        "slug": "git",
        "experience": "4 years",
        "description": "Git is a distributed version control system. I use Git daily for version control, collaboration, and managing code changes across projects."
      },
      {
        "name": "Docker",
        "slug": "docker",
        "experience": "2 years",
        "description": "Docker is a platform for developing, shipping, and running applications in containers. I use Docker to create consistent development environments and simplify deployment processes."
      },
      {
        "name": "GitHub Actions",
        "slug": "github-actions",
        "experience": "1 year",
        "description": "GitHub Actions is a CI/CD platform integrated with GitHub. I use GitHub Actions to automate testing, building, and deployment workflows for my projects."
      },
      {
        "name": "Vercel",
        "slug": "vercel",
        "experience": "2 years",
        "description": "Vercel is a deployment and collaboration platform for frontend developers. I use Vercel for deploying and hosting web applications, taking advantage of its serverless functions and edge network."
      }
    ]
  }
]