[
  {
    "category": "Développement Frontend",
    "slug": "frontend-development",
    "description": "Création d'interfaces utilisateur réactives et accessibles",
    "longDescription": "Le développement frontend se concentre sur la création des éléments visuels et interactifs des sites web et des applications avec lesquels les utilisateurs interagissent directement. Ces compétences me permettent de créer des interfaces utilisateur intuitives, réactives et accessibles qui offrent d'excellentes expériences utilisateur sur tous les appareils.\n\nAvec de solides compétences frontend, je peux transformer des designs en interfaces fonctionnelles, implémenter des interactions complexes, optimiser les performances et garantir le respect des normes d'accessibilité. Le développement frontend moderne nécessite une combinaison de sensibilité au design, de connaissances techniques et d'une compréhension des principes d'expérience utilisateur.",
    "items": [
      {
        "name": "React",
        "slug": "react",
        "experience": "2+ ans",
        "description": "React est une bibliothèque JavaScript pour la création d'interfaces utilisateur. J'ai utilisé React de manière extensive pour créer des applications à page unique et des composants au sein de projets Next.js, en me concentrant sur l'architecture basée sur les composants et la gestion d'état avec les hooks et l'API de contexte."
      },
      {
        "name": "Next.js",
        "slug": "nextjs",
        "experience": "2+ ans",
        "description": "Next.js est un framework React qui permet le rendu côté serveur et la génération de sites statiques. J'ai utilisé Next.js pour créer des applications web performantes et optimisées pour le référencement, en tirant parti de son système de routage basé sur les fichiers et de ses routes API dans des projets comme mon portfolio, ITC Hub et Algis."
      },
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "2+ ans",
        "description": "TypeScript est un langage de programmation fortement typé qui s'appuie sur JavaScript. J'utilise TypeScript dans la plupart de mes projets (portfolio, c-studio, algis, itc-hub) pour assurer la sécurité des types et améliorer l'expérience de développement."
      },
      {
        "name": "Tailwind CSS",
        "slug": "tailwind",
        "experience": "2+ ans",
        "description": "Tailwind CSS est un framework CSS utilitaire. J'utilise Tailwind CSS pour créer rapidement des designs personnalisés sans quitter le HTML, en me concentrant sur la conception responsive et la cohérence des composants dans mes projets Next.js."
      },
      {
        "name": "HTML & CSS",
        "slug": "html-css",
        "experience": "3+ ans",
        "description": "Technologies web de base pour structurer et styliser le contenu web. Utilisées dans tous les projets web."
      }
    ]
  },
  {
    "category": "Développement Backend",
    "slug": "backend-development",
    "description": "Création d'applications côté serveur évolutives et sécurisées",
    "longDescription": "Le développement backend implique la création de la logique côté serveur qui alimente les applications web. Ces compétences me permettent de créer des API robustes, de gérer des bases de données, de gérer l'authentification et de traiter les données efficacement.\n\nDes compétences backend solides sont essentielles pour créer des applications qui peuvent évoluer pour gérer de nombreux utilisateurs, maintenir l'intégrité des données et fournir un accès sécurisé aux ressources. Le développement backend nécessite une connaissance technique approfondie des architectures de serveurs, de la conception de bases de données et des meilleures pratiques de sécurité.",
    "items": [
      {
        "name": "Node.js",
        "slug": "nodejs",
        "experience": "2+ ans",
        "description": "Node.js est un environnement d'exécution JavaScript construit sur le moteur JavaScript V8 de Chrome. J'ai utilisé Node.js pour la logique côté serveur dans les applications Next.js et pour les scripts, y compris au sein du projet Electron c-studio."
      },
      {
        "name": "Express",
        "slug": "express",
        "experience": "1+ an",
        "description": "Express est un framework d'application web Node.js minimal et flexible. Utilisé pour créer des API RESTful."
      },
      {
        "name": "PostgreSQL",
        "slug": "postgresql",
        "experience": "1+ an",
        "description": "PostgreSQL est une base de données relationnelle avancée et open-source. J'ai utilisé PostgreSQL avec Prisma pour le stockage de données dans des projets comme ITC Hub et Algis."
      },
      {
        "name": "Prisma",
        "slug": "prisma",
        "experience": "1+ an",
        "description": "Prisma est un ORM de nouvelle génération pour Node.js et TypeScript. J'utilise Prisma pour interagir avec les bases de données (PostgreSQL et SQLite) dans des projets comme ITC Hub et Algis."
      },
      {
        "name": "SQLite",
        "slug": "sqlite",
        "experience": "1+ an",
        "description": "SQLite est une bibliothèque en langage C qui implémente un moteur de base de données SQL petit, rapide, autonome, de haute fiabilité et complet. Utilisé pour le développement local dans le projet Algis."
      }
    ]
  },
  {
    "category": "Autres Technologies & Outils",
    "slug": "other-tech-and-tools",
    "description": "Développement de bureau, contrôle de version et autres outils",
    "longDescription": "Au-delà du développement web, j'ai de l'expérience dans le développement d'applications de bureau utilisant Electron, le contrôle de version avec Git et l'exploration de langages comme Rust.",
    "items": [
      {
        "name": "Electron",
        "slug": "electron",
        "experience": "1 an",
        "description": "Electron est un framework pour créer des applications natives avec des technologies web comme JavaScript, HTML et CSS. Utilisé pour créer l'IDE C-Studio."
      },
      {
        "name": "Rust",
        "slug": "rust",
        "experience": "<1 an",
        "description": "Rust est un langage axé sur la performance et la sécurité. Exploré à travers le projet iShowOff et intéressé par son potentiel pour les solutions d'entreprise."
      },
      {
        "name": "Git & GitHub",
        "slug": "git-github",
        "experience": "3+ ans",
        "description": "Git est un système de contrôle de version distribué. J'utilise Git et GitHub quotidiennement pour le contrôle de version, la collaboration et la gestion des changements de code à travers les projets, y compris l'utilisation de GitHub Actions pour le CI/CD."
      },
      {
        "name": "Docker",
        "slug": "docker",
        "experience": "1+ an",
        "description": "Docker est une plateforme pour développer, expédier et exécuter des applications dans des conteneurs. Utilisé pour créer des environnements de développement cohérents."
      }
    ]
  }
]
