[
  {
    "role": "Full Stack Developer & Architect",
    "company": "ITC (Proposed Donation)",
    "slug": "itc-developer",
    "type": "Volunteering",
    "period": "Jul 2025 - Present",
    "location": "Remote",
    "summary": "Architected and developed 'ITC Hub', a comprehensive internal management platform, demonstrating enterprise-level system design.",
    "description": "Led the end-to-end development of 'ITC Hub', a complex internal platform designed to streamline club operations. Acting as both Lead Architect and Full Stack Developer, I designed a scalable relational database schema using Prisma and PostgreSQL, implemented secure Role-Based Access Control (RBAC) with NextAuth.js, and built a responsive, type-safe frontend with Next.js and TypeScript. This project showcased my ability to handle the entire software lifecycle, from system architecture and database design to deployment and UI implementation.",
    "skills": [
      "Next.js",
      "TypeScript",
      "Prisma",
      "PostgreSQL",
      "System Architecture",
      "Database Design",
      "Tailwind CSS",
      "Software Architect",
      "Backend",
      "Frontend",
      "Full Stack"
    ],
    "projects": ["ITC Hub - Internal communication and management platform"]
  },
  {
    "role": "Software Engineer",
    "company": "Self-employed/Freelance",
    "slug": "software-engineer",
    "type": "Full-time",
    "period": "Oct 2024 - Present",
    "location": "Remote",
    "summary": "Delivering high-quality web and desktop solutions, from e-commerce platforms to developer tools.",
    "description": "As a versatile Software Engineer, I architect and build robust applications for diverse client needs. My portfolio includes high-conversion landing pages like 'Mosquito Killer DZ', complex analytical tools like 'COD Simulation' for e-commerce ROI, and 'C-Studio', a cross-platform desktop IDE built with Electron. I leverage a modern stack including Next.js, React, Node.js, and Rust to deliver performant, scalable, and user-centric solutions. My work involves full-cycle development, including requirements gathering, UI/UX implementation, backend logic, and CI/CD automation.",
    "skills": [
      "TypeScript",
      "JavaScript",
      "React",
      "Next.js",
      "Node.js",
      "Prisma",
      "PostgreSQL",
      "Electron",
      "Rust",
      "Tailwind CSS",
      "CI/CD",
      "DevOps",
      "Software Engineer",
      "Frontend",
      "Backend"
    ],
    "projects": [
      "Mosquito Killer DZ - High-conversion landing page",
      "COD Simulation - E-commerce ROI calculator",
      "Remdani Dental Center - Clinic website",
      "C-Studio - Desktop IDE for C programming"
    ]
  },
  {
    "role": "Full Stack Developer (Freelance)",
    "company": "Algis (Ministry of Agriculture)",
    "slug": "algis-freelance",
    "type": "Freelance",
    "period": "Jul 2025 - Present (Suspended)",
    "location": "Remote",
    "summary": "Developing a comprehensive Agricultural Management System for the National Office of Agricultural Development.",
    "description": "Algis is a comprehensive Agricultural Management System designed for the National Office of Agricultural Development (Ministry of Agriculture and Rural Development). It digitizes and streamlines management of Agricultural Production Units (UAPs) across Algeria, centralizing scattered Excel data into a relational database with role-based access control, livestock tracking, equipment management, and production analytics. Uses PostgreSQL for hosted versions and SQLite for local development.",
    "skills": [
      "Next.js",
      "React",
      "TypeScript",
      "Prisma",
      "PostgreSQL",
      "NextAuth.js",
      "Tailwind CSS",
      "System Architecture"
    ],
    "projects": ["Algis - Agricultural Management System"]
  },
  {
    "role": "Frontend Developer (Freelance)",
    "company": "Sunrise Energy",
    "slug": "sunrise-energy-freelance",
    "type": "Freelance",
    "period": "2025 (Cancelled)",
    "location": "Remote",
    "summary": "Designed a modern web platform for a renewable energy company (Client Preview).",
    "description": "A modern web platform designed for a renewable energy company. This project served as a client preview to demonstrate the potential for a digital presence in the energy sector. It features a clean, eco-friendly design and showcases services and solutions. The project was cancelled due to client non-payment issues.",
    "skills": ["Next.js", "TypeScript", "Prisma", "Tailwind CSS", "shadcn/ui"],
    "projects": ["Sunrise Energy - Renewable Solutions Platform"]
  },
  {
    "role": "Active Member & Developer",
    "company": "ITC Programming Club",
    "slug": "itc-member",
    "type": "Volunteering",
    "period": "Dec 2024 - Present",
    "location": "Algiers, Algeria",
    "summary": "Contributing to club digital infrastructure and mentoring junior developers.",
    "description": "Key contributor to the club's technical projects, including the official ITCP website and the 'ITC Talks' event platform. I actively participate in code reviews, mentor new members on modern web technologies (React, Next.js), and collaborate on open-source initiatives. This role has honed my teamwork, communication, and collaborative coding skills.",
    "skills": [
      "React",
      "Next.js",
      "Teamwork",
      "Mentoring",
      "Code Review",
      "Collaboration",
      "Frontend"
    ],
    "projects": ["ITCP Website", "ITC Talks Platform"]
  },
  {
    "role": "Frontend Developer",
    "company": "CSE USDB promo 2023",
    "slug": "cse-developer",
    "type": "Volunteering",
    "period": "Oct 2024",
    "location": "Algiers, Algeria",
    "summary": "Developed the frontend for the CSE Hub, ensuring pixel-perfect design implementation.",
    "description": "Served as a core Frontend Developer for the 'CSE Hub' project. I collaborated closely with UI/UX designers to translate Figma prototypes into responsive, interactive React components using Vite. I focused on component reusability, performance optimization, and ensuring a seamless user experience across devices.",
    "skills": [
      "React",
      "Vite",
      "Collaboration",
      "UI/UX",
      "Frontend",
      "Responsive Design"
    ],
    "projects": ["CSE Hub"]
  }
]
