[
  {
    "role": "Full Stack Developer",
    "company": "ITC",
    "slug": "itc-developer",
    "type": "Contract",
    "period": "Jun 2024 - Sep 2024",
    "location": "Remote",
    "summary": "Developed 'ITC Hub', a comprehensive internal platform for department and team management.",
    "description": "Designed and built 'ITC Hub', an internal tool to streamline communication and project management. I was responsible for the full-stack development using Next.js and TypeScript. Key achievements include designing a complex relational database schema with Prisma, implementing Role-Based Access Control (RBAC) with Next-Auth for secure user management, and creating a responsive UI with Tailwind CSS.",
    "skills": [
      "Next.js",
      "TypeScript",
      "Prisma",
      "PostgreSQL",
      "Next-Auth",
      "Tailwind CSS",
      "System Design"
    ],
    "projects": [
      "ITC Hub - Internal communication and management platform"
    ]
  },
  {
    "role": "Junior Software Engineer",
    "company": "Self-employed/Freelance",
    "slug": "junior-software-engineer",
    "type": "Full-time",
    "period": "2023 - Present",
    "location": "Remote",
    "summary": "Developing web and desktop applications, focusing on full-stack JavaScript/TypeScript and exploring Rust.",
    "description": "As a Junior Software Engineer, I am developing various projects, including a portfolio website, the C-Studio IDE, and the Algis agricultural management system for a client. My focus is on using modern web technologies like Next.js, React, TypeScript, and Node.js, along with Prisma for database management. I am also gaining experience with Rust through projects like iShowOff and exploring software architecture and package management.",
    "skills": [
      "TypeScript",
      "JavaScript",
      "React",
      "Next.js",
      "Node.js",
      "Prisma",
      "PostgreSQL",
      "SQLite",
      "Electron",
      "Rust",
      "Git",
      "GitHub Actions",
      "Docker",
      "Tailwind CSS",
      "HTML",
      "CSS"
    ],
    "projects": [
      "Developed and maintain personal portfolio website (Next.js, TypeScript)",
      "Built C-Studio, a zero-setup C IDE for Windows (Electron, TypeScript, React)",
      "Developing Algis, an agricultural management system (Next.js, TypeScript, Prisma, PostgreSQL - private client project)",
      "Customized iShowOff, a Rust-based CLI tool, for GitHub profile README",
      "Developed ITC Hub, an internal communication and project management platform (Next.js, TypeScript, Prisma, PostgreSQL)"
    ]
  }
]
