[
  {
    "title": "E-commerce Platform",
    "slug": "ecommerce-platform",
    "shortDescription": "A full-featured online store with payment processing",
    "description": "A modern e-commerce platform built with Next.js, featuring product listings, a shopping cart, user authentication, and Stripe integration for payments.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "Next.js",
      "React",
      "TypeScript",
      "Tailwind CSS",
      "Stripe"
    ],
    "timeline": "3 months (Jan 2023 - Mar 2023)",
    "liveUrl": "https://example-ecommerce.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/ecommerce",
    "personalExperience": "Building this e-commerce platform was a great experience in integrating third-party APIs like Stripe and managing global state for the shopping cart. I focused on creating a clean, responsive UI and a secure checkout process.",
    "collaborators": []
  },
  {
    "slug": "itc-hub",
    "fetchUrl": "https://itc-hub.vercel.app",
    "title": "ITC Hub",
    "shortDescription": "An internal platform to streamline communication, project management, and collaboration.",
    "description": "A comprehensive, internal platform built to manage departments, teams, a full ticketing system, and an event calendar. Features a role-based user management system (Admin, Manager, User), secure authentication, and a notification system to foster an organized and efficient workflow.",
    "image": "https://itc-hub.vercel.app/ITC%20HUB%20Home.png",
    "technologies": [
      "Next.js",
      "React",
      "TypeScript",
      "Tailwind CSS",
      "shadcn/ui",
      "Prisma",
      "PostgreSQL",
      "Next-Auth",
      "React Hook Form",
      "Zod",
      "Nodemailer",
      "Recharts"
    ],
    "timeline": "4 months (Jun 2024 - Sep 2024)",
    "liveUrl": "https://itc-hub.vercel.app",
    "githubUrl": "https://github.com/samibentaiba/itc-hub",
    "personalExperience": "Developing ITC Hub was a deep dive into full-stack Next.js development. The biggest challenge was designing the relational database schema with Prisma to handle complex relationships between users, departments, teams, and tickets. Implementing role-based access control (RBAC) with Next-Auth was a critical feature to ensure data security. This project solidified my skills in building secure, scalable, and data-intensive web applications.",
    "collaborators": []
  },
  {
    "slug": "ishowoff",
    "fetchUrl": "https://github.com/samibentaiba/ishowoff",
    "title": "iShowOff",
    "shortDescription": "A Go-based command-line tool for displaying system information.",
    "description": "iShowOff is a lightweight, cross-platform CLI tool written in Go. It fetches and displays key system information, such as OS, CPU, memory, and disk usage, in a clean, formatted output. The project was an exploration into Go, system-level programming, and GitHub Actions for automated cross-platform builds.",
    "image": "/placeholder.svg?height=400&width=800",
    "technologies": [
      "Go",
      "GitHub Actions",
      "CLI"
    ],
    "timeline": "1 month (Apr 2024)",
    "liveUrl": null,
    "githubUrl": "https://github.com/samibentaiba/ishowoff",
    "personalExperience": "This was my first major project in Go. I learned a lot about handling OS-specific APIs, managing dependencies in Go, and setting up a CI/CD pipeline with GitHub Actions to compile and release binaries for Windows, macOS, and Linux.",
    "collaborators": []
  }
]