[
  {
    "category": "Frontend Development",
    "slug": "frontend-development",
    "description": "Building responsive and accessible user interfaces",
    "longDescription": "Frontend development focuses on creating the visual and interactive elements of websites and applications that users directly interact with. These skills enable me to build intuitive, responsive, and accessible user interfaces that provide excellent user experiences across all devices.\n\nWith strong frontend skills, I can transform designs into functional interfaces, implement complex interactions, optimize performance, and ensure accessibility standards are met. Modern frontend development requires a combination of design sensibility, technical knowledge, and an understanding of user experience principles.",
    "items": [
      {
        "name": "React",
        "slug": "react",
        "experience": "2+ years",
        "description": "React is a JavaScript library for building user interfaces. I've used React extensively to build single-page applications and components within Next.js projects, focusing on component-based architecture and state management with hooks and context API."
      },
      {
        "name": "Next.js",
        "slug": "nextjs",
        "experience": "2+ years",
        "description": "Next.js is a React framework that enables server-side rendering and static site generation. I've used Next.js to build performant and SEO-friendly web applications, leveraging its file-based routing system and API routes in projects like my portfolio, ITC Hub, and Algis."
      },
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "2+ years",
        "description": "TypeScript is a strongly typed programming language that builds on JavaScript. I use TypeScript in most of my projects (portfolio, c-studio, algis, itc-hub) to ensure type safety and improve developer experience."
      },
      {
        "name": "Tailwind CSS",
        "slug": "tailwind",
        "experience": "2+ years",
        "description": "Tailwind CSS is a utility-first CSS framework. I use Tailwind CSS to rapidly build custom designs without leaving HTML, focusing on responsive design and component consistency in my Next.js projects."
      },
      {
        "name": "HTML & CSS",
        "slug": "html-css",
        "experience": "3+ years",
        "description": "Core web technologies for structuring and styling web content. Used in all web-based projects."
      }
    ]
  },
  {
    "category": "Backend Development",
    "slug": "backend-development",
    "description": "Building scalable and secure server-side applications",
    "longDescription": "Backend development involves creating the server-side logic that powers web applications. These skills allow me to build robust APIs, manage databases, handle authentication, and process data efficiently.\n\nStrong backend skills are essential for creating applications that can scale to handle many users, maintain data integrity, and provide secure access to resources. Backend development requires deep technical knowledge of server architectures, database design, and security best practices.",
    "items": [
      {
        "name": "Node.js",
        "slug": "nodejs",
        "experience": "2+ years",
        "description": "Node.js is a JavaScript runtime built on Chrome's V8 JavaScript engine. I've used Node.js for server-side logic in Next.js applications and for scripting, including within the c-studio Electron project."
      },
      {
        "name": "Express",
        "slug": "express",
        "experience": "1+ year",
        "description": "Express is a minimal and flexible Node.js web application framework. Used for building RESTful APIs."
      },
      {
        "name": "PostgreSQL",
        "slug": "postgresql",
        "experience": "1+ year",
        "description": "PostgreSQL is an advanced, open-source relational database. I've used PostgreSQL with Prisma for data storage in projects like ITC Hub and Algis."
      },
      {
        "name": "Prisma",
        "slug": "prisma",
        "experience": "1+ year",
        "description": "Prisma is a next-generation ORM for Node.js and TypeScript. I use Prisma to interact with databases (PostgreSQL and SQLite) in projects like ITC Hub and Algis."
      },
      {
        "name": "SQLite",
        "slug": "sqlite",
        "experience": "1+ year",
        "description": "SQLite is a C-language library that implements a small, fast, self-contained, high-reliability, full-featured, SQL database engine. Used for local development in the Algis project."
      }
    ]
  },
  {
    "category": "Other Technologies & Tools",
    "slug": "other-tech-and-tools",
    "description": "Desktop development, version control, and other tools",
    "longDescription": "Beyond web development, I have experience with desktop application development using Electron, version control with Git, and exploring languages like Rust.",
    "items": [
      {
        "name": "Electron",
        "slug": "electron",
        "experience": "1 year",
        "description": "Electron is a framework for creating native applications with web technologies like JavaScript, HTML, and CSS. Used to build the C-Studio IDE."
      },
      {
        "name": "Rust",
        "slug": "rust",
        "experience": "<1 year",
        "description": "Rust is a language focused on performance and safety. Explored through the iShowOff project and interested in its potential for enterprise solutions."
      },
      {
        "name": "Git & GitHub",
        "slug": "git-github",
        "experience": "3+ years",
        "description": "Git is a distributed version control system. I use Git and GitHub daily for version control, collaboration, and managing code changes across projects, including using GitHub Actions for CI/CD."
      },
      {
        "name": "Docker",
        "slug": "docker",
        "experience": "1+ year",
        "description": "Docker is a platform for developing, shipping, and running applications in containers. Used to create consistent development environments."
      }
    ]
  }
]
