[
  {
    "category": "Development Operations",
    "slug": "development-operations",
    "description": "Integrating OS, Frontend, Backend, and Languages to manage complex state and workflows.",
    "longDescription": "Development Operations uses all skills of Operating Systems, Frontend, Backend, Programming Languages, and other technologies. It handles the work of other people because of the complex state it can get and deals with many fields.",
    "items": [
      {
        "name": "Pipeline Manipulation",
        "slug": "pipeline-manipulation",
        "experience": "Applied",
        "description": "Using ngrok for exposing local servers and manipulating pipelines for webhook testing. Used effectively in the AiHorizons project."
      },
      {
        "name": "Microservices",
        "slug": "microservices",
        "experience": "Applied",
        "description": "Designing applications as a collection of loosely coupled services. I explored this architecture in the H2-SpringBoot project."
      },
      {
        "name": "Git & GitHub",
        "slug": "git-github",
        "experience": "3+ years",
        "description": "Git is a distributed version control system. I use Git and GitHub daily for version control, collaboration, and managing code changes across projects, including using GitHub Actions for CI/CD."
      },
      {
        "name": "GitHub Actions",
        "slug": "github-actions",
        "experience": "1+ year",
        "description": "Automating software workflows with CI/CD pipelines directly in GitHub. I use it for automated testing and deployment."
      },
      {
        "name": "CI/CD",
        "slug": "ci-cd",
        "experience": "Applied",
        "description": "Continuous Integration and Continuous Deployment practices to automate the software delivery process."
      },
      {
        "name": "Docker",
        "slug": "docker",
        "experience": "1+ year",
        "description": "Docker is a platform for developing, shipping, and running applications in containers. Used to create consistent development environments."
      },
      {
        "name": "Vercel",
        "slug": "vercel",
        "experience": "2+ years",
        "description": "Vercel is a deployment and collaboration platform for frontend developers. I use Vercel to deploy and host web applications, leveraging its serverless functions and edge network."
      },
      {
        "name": "Linux Ecosystem",
        "slug": "linux",
        "experience": "Mastered",
        "description": "Deep mastery of distributions like Arch, Ubuntu, Fedora, Debian, Kali, Mint, and Nix. Proficient in shell scripting and system configuration."
      },
      {
        "name": "Unix Systems",
        "slug": "unix",
        "experience": "Familiar",
        "description": "Experience with macOS and OpenBSD, leveraging their stability and Unix philosophy for robust development environments."
      },
      {
        "name": "Windows",
        "slug": "windows",
        "experience": "Proficient",
        "description": "Used primarily for design collaboration (Figma) and compatibility testing, managing development limitations with custom configurations."
      }
    ]
  },
  {
    "category": "Frontend Development",
    "slug": "frontend-development",
    "description": "Building responsive and accessible user interfaces",
    "longDescription": "Frontend development focuses on creating the visual and interactive elements of websites and applications that users directly interact with. These skills enable me to build intuitive, responsive, and accessible user interfaces that provide excellent user experiences across all devices.\n\nWith strong frontend skills, I can transform designs into functional interfaces, implement complex interactions, optimize performance, and ensure accessibility standards are met. Modern frontend development requires a combination of design sensibility, technical knowledge, and an understanding of user experience principles.",
    "items": [
      {
        "name": "React",
        "slug": "react",
        "experience": "2+ years",
        "description": "React is a JavaScript library for building user interfaces. I've used React extensively to build single-page applications and components within Next.js projects, focusing on component-based architecture and state management with hooks and context API."
      },
      {
        "name": "Next.js",
        "slug": "nextjs",
        "experience": "2+ years",
        "description": "Next.js is a React framework that enables server-side rendering and static site generation. I've used Next.js to build performant and SEO-friendly web applications, leveraging its file-based routing system and API routes in projects like my portfolio, ITC Hub, and Algis."
      },
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "2+ years",
        "description": "TypeScript is a strongly typed programming language that builds on JavaScript. I use TypeScript in most of my projects (portfolio, c-studio, algis, itc-hub) to ensure type safety and improve developer experience."
      },
      {
        "name": "Tailwind CSS",
        "slug": "tailwind",
        "experience": "2+ years",
        "description": "Tailwind CSS is a utility-first CSS framework. I use Tailwind CSS to rapidly build custom designs without leaving HTML, focusing on responsive design and component consistency in my Next.js projects."
      },
      {
        "name": "shadcn/ui",
        "slug": "shadcn-ui",
        "experience": "1+ year",
        "description": "A collection of re-usable components built using Radix UI and Tailwind CSS. I use it to build accessible and customizable UIs in my Next.js projects."
      },
      {
        "name": "HTML & CSS",
        "slug": "html-css",
        "experience": "3+ years",
        "description": "Core web technologies for structuring and styling web content. Used in all web-based projects."
      },
      {
        "name": "Vite",
        "slug": "vite",
        "experience": "1+ year",
        "description": "Vite is a build tool that aims to provide a faster and leaner development experience for modern web projects. I use it for my React projects."
      },
      {
        "name": "Angular",
        "slug": "angular",
        "experience": "<1 year",
        "description": "Angular is a platform for building mobile and desktop web applications. I have experience with it through the H2-SpringBoot project."
      },
      {
        "name": "Electron",
        "slug": "electron",
        "experience": "1 year",
        "description": "Electron is a framework for creating native applications with web technologies like JavaScript, HTML, and CSS. Used to build the C-Studio IDE."
      }
    ]
  },
  {
    "category": "Backend Development",
    "slug": "backend-development",
    "description": "Building scalable and secure server-side applications",
    "longDescription": "Backend development involves creating the server-side logic that powers web applications. These skills allow me to build robust APIs, manage databases, handle authentication, and process data efficiently.\n\nStrong backend skills are essential for creating applications that can scale to handle many users, maintain data integrity, and provide secure access to resources. Backend development requires deep technical knowledge of server architectures, database design, and security best practices.",
    "items": [
      {
        "name": "Node.js",
        "slug": "nodejs",
        "experience": "2+ years",
        "description": "Node.js is a JavaScript runtime built on Chrome's V8 JavaScript engine. I've used Node.js for server-side logic in Next.js applications and for scripting, including within the c-studio Electron project."
      },
      {
        "name": "Express",
        "slug": "express",
        "experience": "1+ year",
        "description": "Express is a minimal and flexible Node.js web application framework. Used for building RESTful APIs."
      },
      {
        "name": "PostgreSQL",
        "slug": "postgresql",
        "experience": "1+ year",
        "description": "PostgreSQL is an advanced, open-source relational database. I've used PostgreSQL with Prisma for data storage in projects like ITC Hub and Algis."
      },
      {
        "name": "Prisma",
        "slug": "prisma",
        "experience": "1+ year",
        "description": "Prisma is a next-generation ORM for Node.js and TypeScript. I use Prisma to interact with databases (PostgreSQL and SQLite) in projects like ITC Hub and Algis."
      },
      {
        "name": "SQLite",
        "slug": "sqlite",
        "experience": "1+ year",
        "description": "SQLite is a C-language library that implements a small, fast, self-contained, high-reliability, full-featured, SQL database engine. Used for local development in the Algis project."
      },
      {
        "name": "Java",
        "slug": "java",
        "experience": "1+ year",
        "description": "Java is a high-level, class-based, object-oriented programming language. I use it for backend development with Spring Boot."
      },
      {
        "name": "Spring Boot",
        "slug": "spring-boot",
        "experience": "1+ year",
        "description": "Spring Boot is an open source Java-based framework used to create a micro Service. I use it to build robust and scalable backend services."
      },
      {
        "name": "Next.js",
        "slug": "nextjs-backend",
        "experience": "2+ years",
        "description": "I leverage Next.js for full-stack development, utilizing API Routes and Server Actions to build secure and scalable backend logic directly within the application."
      },
      {
        "name": "NextAuth.js",
        "slug": "next-auth",
        "experience": "1+ year",
        "description": "A complete open-source authentication solution for Next.js applications. I use it to handle secure user authentication and session management."
      }
    ]
  },
  {
    "category": "Programming Languages",
    "slug": "programming-languages",
    "description": "Languages I am familiar with or have explored",
    "longDescription": "I have a strong foundation in several programming languages. I am very familiar with C and Bash, having used them for system-level programming and automation. I have also explored a variety of other languages to broaden my understanding of different paradigms, including C++, C#, Python, Go, and Haskell.",
    "items": [
      {
        "name": "TypeScript",
        "slug": "typescript",
        "experience": "Familiar",
        "description": "My primary language for web development, ensuring type safety and code quality."
      },
      {
        "name": "JavaScript",
        "slug": "javascript",
        "experience": "Familiar",
        "description": "Deep understanding of ES6+ features and the core language concepts."
      },
      {
        "name": "C",
        "slug": "c-lang",
        "experience": "Familiar",
        "description": "I am very familiar with C, using it for system programming and understanding low-level concepts. It's the core language supported by my C-Studio IDE."
      },
      {
        "name": "Bash",
        "slug": "bash",
        "experience": "Familiar",
        "description": "I use Bash scripting for automation and managing development environments."
      },
      {
        "name": "Rust",
        "slug": "rust",
        "experience": "<1 year",
        "description": "Rust is a language focused on performance and safety. Explored through the iShowOff project and interested in its potential for enterprise solutions."
      },
      {
        "name": "Python",
        "slug": "python",
        "experience": "Explored",
        "description": "Explored Python for scripting and data processing tasks."
      },
      {
        "name": "Go",
        "slug": "go",
        "experience": "Explored",
        "description": "Explored Go for its concurrency model and performance in backend systems."
      },
      {
        "name": "C++",
        "slug": "cpp",
        "experience": "Explored",
        "description": "Explored C++ to understand object-oriented programming at a system level."
      },
      {
        "name": "C#",
        "slug": "csharp",
        "experience": "Explored",
        "description": "Explored C# for desktop and game development concepts."
      },
      {
        "name": "Haskell",
        "slug": "haskell",
        "experience": "Explored",
        "description": "Explored Haskell to understand functional programming paradigms."
      },
      {
        "name": "IDEs & Editors",
        "slug": "ides-editors",
        "experience": "Mastered",
        "description": "Mastery of Neovim, VS Code, and Nano with custom keybinds, LSP tuning, and profiles. Experienced with JetBrains, Emacs, and CodeBlocks. I maintain a custom Neovim config (github.com/samibentaiba/nvim)."
      }
    ]
  },
  {
    "category": "Architecture & Documentation",
    "slug": "architecture-documentation",
    "description": "Designing scalable systems and documenting technical details",
    "longDescription": "I believe that great software starts with a solid design and is maintained through clear documentation. I use visual tools to map out system architectures and design patterns, ensuring that every component is well-understood and scalable. My approach involves deep source code analysis and creating comprehensive guides for future maintenance.",
    "items": [
      {
        "name": "Figma",
        "slug": "figma",
        "experience": "Collaborative",
        "description": "Learned through collaboration with UI/UX designers to implement pixel-perfect designs and understand design systems."
      },
      {
        "name": "System Architecture",
        "slug": "system-architecture",
        "experience": "Applied",
        "description": "Designing scalable systems, microservices, and database schemas. I use tools like Excalidraw and Figma to visualize code flows, design patterns, and architectural decisions."
      },
      {
        "name": "Technical Documentation",
        "slug": "technical-documentation",
        "experience": "Applied",
        "description": "Creating comprehensive documentation for code, APIs, and system designs using Obsidian. I focus on explaining the 'why' behind technical decisions to facilitate maintenance and onboarding."
      },
      {
        "name": "Source Code Analysis",
        "slug": "source-code-analysis",
        "experience": "Applied",
        "description": "Deep dive into complex codebases and documentation (e.g., WordPress core) to understand best practices, reverse engineer logic, and implement robust solutions."
      }
    ]
  }
]
